[
    {
        "name": "The butterfly and the pig",
        "rating": 4,
        "text": "The food was fantastic! The Colin Coley and cauliflower veggie appetizer was fantastic! The sticky toffee pudding was OK. We need a bigger plate and moist pudding. We also created some ambience by lighting our candle. The steak pie looks delicious. My partner and his friend said it was good. We will return!"
    },
    {
        "name": "The butterfly and the pig",
        "rating": 5,
        "text": "Lovely wee place with loads of mismatched tea-sets and teapots! Very cosy and the food was great. You could order the Afternoon Tea (which was NOT expensive for an afternoon tea; I was expecting to pay almost double before I saw the menu) or you could get regular breakfast food, like a really nice Eggs Benedict or French Toast. These were all delicious according to the group I was with! Would definitely recommend, especially if you'd like to bring someone for a nice Afternoon Tea and chat!"
    },
    {
        "name": "The butterfly and the pig",
        "rating": 5,
        "text": "we ordered Crissssspy mushroom frittersss served with spicy mayo and a side salad, Suzie the smoked salmon mousse, hitting snooze on a bed of toast, served with a side salad, Butterfly and piglet burger and The swimming piggies... Pan seared king scallops served on a black pudding crumb with crispy pork belly, chorizo oil and a smoked bacon salt. The food is wonderful very creative."
    },
    {
        "name": "The butterfly and the pig",
        "rating": 4,
        "text": "Really nice food. Pricing for drinks was a bit exorbitant but the great service made up for the cost for sure.\n\nThey were even so kind as to make our afternoon tea vegetarian friendly at absolutely no notice because I was an idiot and forgot that I was bringing my vegetarian friend with me. 🤦🏼‍♀️😂\n\nLovely selection of nibbles within the afternoon tea and great value for what you get.\n\nThe soup was also amazing. 🥰\n\nWould definitely come again and want to try their restaurant next time!"
    },
    {
        "name": "The butterfly and the pig",
        "rating": 5,
        "text": "It's such a cute place, definitely worth a visit. Book a table as it's busy and you may need to sit in the basement which isn't as atmospheric. The food was very tasty and affordable too."
    },
    {
        "name": "Browns Glasgow",
        "rating": 5,
        "text": "Visited on Sunday and had the sliced sirloin roast, I was really impressed! The meat was so tender and tasty 👌🏻 beautiful presentation and the veg was delicious too. Service was also friendly and quick would definitely recommend."
    },
    {
        "name": "Browns Glasgow",
        "rating": 4,
        "text": "I went to Browns with my Partner for Christmas Eve dinner (which is kind important for us because of the culture factor) and we took Festive 🎄 3 courses menu 🍽️ with drinks 🍹\n\nFirst we place the order for drinks and we went with Negroni (which was sadly out of stock) so as alternative replacement was recommendation (from very professional and super kind 'Romanian' waiter) to try Old Fashioned cocktail instead. Which was not really close to Negroni but for Scottish Whiskey Experience fine enough 😊\nCask - Belheaven - local beer was really good 👍\n\nFor Starter I took Smoked Salmon (again Scottish 🏴󠁧󠁢󠁳󠁣󠁴󠁿🫶) with Horseradish Crème Fraiche, capers and toasted ciabatta. Which was a fair introduction to the Main dish.\n\nBraised blade of beef 🍖with mashed, quite sophisticated selection of veg and black garlic sauce was very tasty and meat was incredibly tender\n\nAnd for the dessert I get classical Christmas Pudding 🍮with Brandy butter which was alright but a bit to dry.\n\nOf some reason we didn't get our Finish what supposed to be Cheese 🧀 Selection 🤷\n\nGenerally quite pleasant dinner we had but we both agree that portions have been a bit to small and there wasn't much to be surprised of the textures or ingredients.\nFor £38 without a drink it was still one of the cheapest Festive Menus option in central Glasgow but we guess it was a slightly disappointing.\nIn TOTAL we have paid almost £125 and that's a lot in our opinion.\n\nNo matter what it was pretty nice evening after all (with a bit of thrill 💣 when we received by mistake not our bill for £260😅)\nSo we had a joyful time."
    },
    {
        "name": "Browns Glasgow",
        "rating": 4,
        "text": "The food was delish! Our group had several of the dishes and all were good. Only item to improve was the pastry on the veggie Wellington was a little over-done."
    },
    {
        "name": "Browns Glasgow",
        "rating": 3,
        "text": "1 main returned twice - items cold\n1 main returned - main element cool\n1 dessert tasted like a stale donut and luke warm\n1 christmas pudding cold and tasted like it was uncooked from refridgerator.\n\nStaff dealt very professionally, removed automatic charged 10% gratuity, which is a poor practice for a table of 3, and we were not charged for desserts."
    },
    {
        "name": "Browns Glasgow",
        "rating": 5,
        "text": "the geezer serving us was a gent, we were hungover to bits but this place looked after us, lobster 🦞 Benedict and traditional breakfast were top class, mouth watering food to finish it ff a lovely trip to G-town, Rise up Glasgow, can’t wait to return! So reasonably priced too, Happy new year to the staff!"
    },
    {
        "name": "La Bonne Auberge",
        "rating": 5,
        "text": "Absolutely AMAZING food, could not even fault it. Cocktails... Well they could have been done better, but you work with what you got. Service lovely. But the food and style were just astounding. Well done to the chefs. Cause the food was bloody fab."
    },
    {
        "name": "La Bonne Auberge",
        "rating": 4,
        "text": "Amazingly friendly staff, very tasty food, and quick service. Fairly limited menu, but everything we had was quite tasty. Prices were a bit high, but we received a discount as hotel guests. Worth a stop if you're staying at the connected Holiday Inn."
    },
    {
        "name": "La Bonne Auberge",
        "rating": 5,
        "text": "Lovely Christmas menu with hot food and hot plates.  A real difficulty is selection from a number of tempting sounding dishes.  Mist have a twist on the ordinary which makes a repeat visit a near necessity before the festive season ends."
    },
    {
        "name": "La Bonne Auberge",
        "rating": 2,
        "text": "It’s an ok place with decent staff, if somewhat lacking in atmosphere. They don’t sell any Scottish beer or lager though - as a matter of policy. Just another foreign multiple. They won’t get my custom again."
    },
    {
        "name": "La Bonne Auberge",
        "rating": 5,
        "text": "Nice restaurant; booked a table during the week for the 2/3 course special. The selections were great and the food was awesome. The staff there were also very patient, as we had a somewhat late booking. I got some minced steak as my main and creme Brule as dessert, can't exactly remember what my friend ordered but I've inserted a photo. I'd definitely recommend the place."
    },
    {
        "name": "One Restaurant",
        "rating": 5,
        "text": "Very delicious food and drinks. Quick, modern, and friendly and helpful staff."
    },
    {
        "name": "One Restaurant",
        "rating": 5,
        "text": "Had afternoon tea today with 3 friends. Food was lovely both choice and amount. Our server Grace  was so attentive and nothing was a bother too her, lovely girl. Setting spacious and very clean. We have been before for afternoon tea and would recommend to anyone for lovely time."
    },
    {
        "name": "One Restaurant",
        "rating": 2,
        "text": "The food was lovely but the service was bad. Had to go and ask for our orders to be taken then again a half hour later to ask where the meal was. When it finally arrived it was delicious but we were too hurried then to really enjoy it."
    },
    {
        "name": "One Restaurant",
        "rating": 5,
        "text": "God food god servive nice and friendly staff. Sorry for my bad England"
    },
    {
        "name": "One Restaurant",
        "rating": 3,
        "text": "The food was nice enough but the staff were not very well informed about the food and drink on offer so we're not very helpful when it came to answering questions."
    },
    {
        "name": "La Vita",
        "rating": 4,
        "text": "Italian food with lots of options.\nGot the garlic bread for starter but they’re a bit burnt but still nice, also got calamari, which wasn’t fried enough for our liking, the haggis arancini didn’t have much flavour.\n\nThe tagliatelle calabrese is very nice lots of sauce and sausage, very flavourful! I really recommend this! My friend had the Quattro stagioni which she found alright. I love how you can get half pasta here, very accommodating.\n\nFor dessert I had the chocolate covered strawberry tart. The tart is quite dense, is massive portion, I had a lot of whip cream in the middle. My friend got the cheese cake which looking amazing but she found it too sweet.\n\nTried the festive cocktail merry kiss mas, it was very sweet, if you have a sweet tooth it’s be perfect for you. The clausmopolitan is nice. I love the cocktail menu here, you have so many options to choose from.\n\nThe menu is big with good varieties. There’s plenty of seatings but not much leg room upstairs, the corridors are narrow, the decor is very festive, Craig who served us is great!"
    },
    {
        "name": "La Vita",
        "rating": 5,
        "text": "I enjoyed my experience here. The food was 10/10 so good so yummy. The staff are AH-mazing! So friendly and so helpful. Would definitely recommend and would definitely come back."
    },
    {
        "name": "La Vita",
        "rating": 1,
        "text": "some staffs are nice but some are being cool I dont know why，my pasta is super less flavor and the chicken inside is hard as stone. Also my daily soup is salty，pizza is burnt and sour，so extreme，amazing，we were told only 45mins to have the meal，then they deliver our desert first，then spaghetti ,then soup, then dinner bread😅First time eating upside down，one staff being super inexorability to us but so nice to the costumers behind us and keep chatting，meanwhile me and my friend only have 10mins to eat😅 I dont even do anything or say anything，this is rude，bad experience i have to say. My first time leave comment on google map"
    },
    {
        "name": "La Vita",
        "rating": 5,
        "text": "\" Life is Beautiful \" @ La Vita as are the meals and service. They handle the larger demands at this busy time of the year effortlessly.\nTheir traditional italian meals are exceptional but you`ve got to try their traditional scottish breakfast : )"
    },
    {
        "name": "La Vita",
        "rating": 4,
        "text": "I came here to have breakfast and loved the food. We came here after walking a lot to find a place to get some classy breakfast, and it was definitely worth it. The waiters were very friendly and the food arrived pretty quickly. Next time I will be here to get some nice lunch or dinner."
    },
    {
        "name": "The Ivy Buchanan Street, Glasgow",
        "rating": 2,
        "text": "Not sure if was because it was the week between Christmas and New Year, but the food wasn't anywhere near as good as our last visit.\n\nThe prawn and lobster cocktail was lacking in any flavour, with the prawn tasting like they had just been defrosted. The chicken was over cooked and very dry. Finally the profiteroles tasted stale.\n\nBad on this visit, I don't think I'd return."
    },
    {
        "name": "The Ivy Buchanan Street, Glasgow",
        "rating": 2,
        "text": "💀FOOD 2/10💀 I dont know why ppl bang on about this chain. Great decor. Great foodpresentation. Poor food quality.Overpriced.\n🙂SERVICE 8/10\n💀TOILETS 💀 you what they say establishments with unkept unsanitary toilets, the food aint gonna be clean nor quality.\n\nI got the eggs benedict - and the muffins were stale, with no life in them. Not toasted. Nothing.\nThe haggis bon bons, were a waste sadly. Not much flavour in them. Pretty sure the \"fresh juice\" is from a bottle, too.\nI think the only thing i enjoyed was my tea."
    },
    {
        "name": "The Ivy Buchanan Street, Glasgow",
        "rating": 5,
        "text": "What a beautiful restaurant sends you back to the early 39-40's .staff are immaculately dressed and so polite and informative about food and wines .we had set 2 course menu with a lovely bottle of white .I had salmon with dark seeded pumpernickel bread and shepards pie for main .Well done everyone"
    },
    {
        "name": "The Ivy Buchanan Street, Glasgow",
        "rating": 2,
        "text": "Very disappointing experience I'm afraid!\nI was at Ivy Glasgow before but this time they weren't able to live up to expectations sadly.. Soufflé, smoked salmon and chocolate bomb options were all ran out! I mean this is Xmas time if a restaurant at this level doesn't know  their market and demand after all these years then I'm not sure who should be! The food was lacking the wow factor when came out, we weren't particularly impressed with the look and taste which is very disappointing when you've set up such high bar for yourself!\nService wasn't great either you could see the staff are exhausted and not particularly thrilled to see you! the first servant wasn't so focused so accidentally dropped the knife on the table which could've easily ended in an incident; think he then preferred not to carry on with the service to us as poor guy was so embarrassed, and so passed us over to his colleague..\nWhen desert was served we noticed a soiled teaspoon which wasn't helping at all after all the experience we had already!\nAnd to complete the package when we were leaving and went to grab our umbrella at the entrance realised that it's gone! When asked a member of staff we were told it could've been lifted by someone! I mean are you serious?! At least don't offer customers to leave their umbrella at the door if you can't guarantee the security! Got really pissed by this as it was a sturdy brand new umbrella we got to use for the visit and now it's gone after a single use! Was raging and it ruined the whole experience even more so!\nSo no not a great experience this time round for us!\nAll the fancy stuff you see on the Instagram page is just for the sake of social media!\nAll that said, I do love the drinks and cocktails though and certainly do admire the interior design and ambience.."
    },
    {
        "name": "The Ivy Buchanan Street, Glasgow",
        "rating": 4,
        "text": "Excellent service and very good food.  Great to see The Ivy doing a fixed price 2 course menu.   Portions could have been a bit more substantial"
    },
    {
        "name": "The Left Bank",
        "rating": 5,
        "text": "This place never lets you down. Welcoming staff, wide selection of  menus - and including vegetarian and separate vegan menus - and they accept dogs!\nThis time I had the vegetarian Indian Pole Bowl. So delicious, freshest of ingredients and super filling. Happy ⭐️Happy ⭐️ Happy⭐️"
    },
    {
        "name": "The Left Bank",
        "rating": 5,
        "text": "Fantastic experience! Delectable food and super reasonable prices. Our waiter was kind, patient, and lovely to chat with. The food came out quickly and we loved everything. I would absolutely recommend the eggs with smoked salmon and one of the refreshing seltzers. If I'm ever in Glasgow again, I'll make sure to stop by this place for some delicious food and great people."
    },
    {
        "name": "The Left Bank",
        "rating": 5,
        "text": "This is an absolutely spot-on place for atmosphere, service & food.  It's not cheap but definitely NOT overpriced for the quality, taste and service of food.\nI went with the chef's soup of the day (coconut & tumeric) accompanied with toasted sourdough bread and astoundingly salubrious and flavoursome olives - fresh water is served at every table.\nStaff are lovely and genuinely helpful.\nWill return! 💖"
    },
    {
        "name": "The Left Bank",
        "rating": 5,
        "text": "Must visit!\n\nincredible service. Enjoyed the most delicious Xmas dinner here. The staff were excellent and supporting big group bookings and the process of organising with them was super smooth. The food was divine! Roast was perfection, bean cassoulet was wow. Credits to the chef and to the wonderful staff. A special thanks especially to Callum who made the meal out extra special. I’ll be back and recommending the left bank to anyone looking for delicious food with excellent service in the west end"
    },
    {
        "name": "The Left Bank",
        "rating": 4,
        "text": "My colleague recommended this brunch cafe to me, so I decided to drop in for a quick meal. The staff were exceptionally friendly. I ordered a bank breakfast and a pot of breakfast tea. Overall, the food was good, but the mushrooms and bean were too cold. Additionally, I wasn't provided with any cutlery at the beginning of my meal, so I had to request a fork and knife from the staff later on. Despite these minor inconveniences, I might still recommend the place overall."
    },
    {
        "name": "Café Andaluz",
        "rating": 5,
        "text": "Really nice dinner. Lots of sharing of excellent food. Flavours galore. The staff was also amazing considering a good allergy -- showed us what was safe, as well as what could be made without. Super accommodating, and the meal was just terrific."
    },
    {
        "name": "Café Andaluz",
        "rating": 5,
        "text": "Great offer on Sundays. 3 tapas & dessert for £22.95. It was delicious. Menu is separated into sections so vegetarian options are easily identified. We had 6 and out of a possible 12 (?). Amazing. All delicious. Special mention to the goats cheese! And the desserts were great too. We chose brownie and cheesecake. Staff were lovely.  Keeping an eye on everybody. It was very busy but the wait for food and a very nice glass of rose was minimal."
    },
    {
        "name": "Café Andaluz",
        "rating": 5,
        "text": "First time here and not the last. The host was great as we were half an hour early but got seated even though it was really busy. The service was top class with every member of staff working really well together. The food was excellent so will have to go back and try some different dishes. Really nice atmosphere though the chatting was a little loud at times which can't be helped. My recommendation is the gambas picantes."
    },
    {
        "name": "Café Andaluz",
        "rating": 5,
        "text": "I loved this place so much, went there twice during my short stay in Glasgow.\nThe raspberry dessert I had was probably the best dessert I’ve had in a while.\nThe next time I visited, I had their weekend Spanish Brunch, it was amazing.\nWould highly recommend this place."
    },
    {
        "name": "Café Andaluz",
        "rating": 5,
        "text": "Food is very good, we had a great selection of tapas and it was really tasty.\nService was quick, and the plates were really hot, which is a good trait.\nIt was a midweek day, and the place was still buzzing, so that was a good sign.\nIf you like Spanish food, I can recommend this place, and it's not extortionate in its pricing."
    },
    {
        "name": "Sarti",
        "rating": 5,
        "text": "An almost perfect dining experience, from the atmosphere, to the food to the service all impeccable. Would be lovely to have a date night here. The pizza and the pasta that we had was simply divine."
    },
    {
        "name": "Sarti",
        "rating": 3,
        "text": "Went here for lunch. We got the menus and it took 15 minutes for anyone to take our order. We then waited another 20 minutes for bottled beers to be brought to our table, which is far too long. Starter arrived after the main, even though we asked for it to be brought out before. Food was mediocre and we've had a lot better Italian food in Glasgow - how you can serve foccacia burnt on the outside while not properly cooked on the inside is beyond me. Overall a very mediocre experience so won't be back.\n\nEdit: As you can see from their reply, this is their \"perfectly cooked focaccia\". I've had focaccia in lots of places and none of them served it late, burnt, oversalted and proud about it. The one I had can be described in many ways, but delicious is definitely not one of them."
    },
    {
        "name": "Sarti",
        "rating": 5,
        "text": "What a fantastic find. It's no wonder this restaurant is popular and very busy. The food was incredible, service fantastic and a warm authentic Italian atmosphere. Highly recommended a meal here."
    },
    {
        "name": "Sarti",
        "rating": 4,
        "text": "Very nice restaurant in Glasgow city centre with friendly staff and delicious food, also has a gigantic selection of wines though I did not try any on this occasion.\n\nI would have happily given 5 stars but when I went to tip the server upon paying, I was very unimpressed to find out that a 12.5% \"gratuity charge\" had been added on the bill without anyone saying."
    },
    {
        "name": "Sarti",
        "rating": 5,
        "text": "My favourite Italian restaurant in Glasgow. Hands down the best. The food is excellent, great portion sizes, great variety, lovely staff, beautiful interior with lots of amazing produce to buy. The panettone I got for Christmas was sooo delicious!"
    },
    {
        "name": "Bar + Block Steakhouse Glasgow",
        "rating": 4,
        "text": "My first time going, o/h had been 3 or 4 times.with friends\n\nThe chicken, dear lord the chicken is absolutely beautiful/tender.  I always loved a half roast chicken but so many places stopped selling it.\n\nO/h got the steak.\n\nOthers got the ultimate so the chicken, bit of beef, bit of lamb.  Our other guest had lamb.\n\nGravy pots are really small but can ask for more.  My roast potatoes were really drink but I got more gravy.\n\nGot a side of pigs in blankets and the mushrooms.  So nice.\n\nWater for the table, they didn't sell pepsi max (my fave) but do have diet coke.\n\nWe booked.\n\nToilets are upstairs but they have a disabled downstairs.\n\nBeautiful interior, big, lovely design.\n\nStaff really nice, repeat drinks took a while to come for with the food and it wasn't overly busy but otherwise great and would certainly go back 4.5/5.\n\nThey also have a boozy brunch style menu  £30 for drinks (cocktails) and food, think I saw cheesy bites so we will need to check that out sometime."
    },
    {
        "name": "Bar + Block Steakhouse Glasgow",
        "rating": 5,
        "text": "I was there for my birthday with my dinner with my fiance & we had a couple of cocktails, lovely food & we shared a bottle of fizz, which was really nice. We had great service & the atmosphere was good as well. When we went into Bar + Block restaurant, there was a female singer on & she was really good. I would go back again, but maybe go for lunch during the day. Excellent restaurant & Excellent food."
    },
    {
        "name": "Bar + Block Steakhouse Glasgow",
        "rating": 5,
        "text": "First time coming here for a meal, and I was very impressed. The food was amazing! The staff were lovely and welcoming too. This restaurant has a chilled family atmosphere and I look forward to returning again in the near future!"
    },
    {
        "name": "Bar + Block Steakhouse Glasgow",
        "rating": 5,
        "text": "Every time we come to this Bar + Block we have a fantastic meal.\nWe've always found the staff to be professional, friendly and very helpful.\nOn this visit, we were greated by Waheed, a really nice guy from Egypt, who was very polite and friendly and likes to call you by your first name if your amenable for him to do so, which was refreshing. He couldn't do enough for us.\nWe decided to start with 4 small plates for £21. They consisted of  Asian Crispy Beef (Tossed in hoisin, cucumber, spring onions, chilli and coriander), Garlic King Prawns (Cooked over charcoal with plenty of garlic butter, served with stonebaked flatbread), Salt + Pepper Squid (With fresh chilli and parsley, served with garlic mayo) & Beef Burnt Ends (Drizzled with homemade chimichurri). All were really nice, but the Asian Crispy Beef and Salt + Peeper Squid were sensational. We were off to a good start.\nWe had the 14oz Spiral Cut Angus Ribeye & Bar + Block House Salad with Salmon Fillet for our mains.\nWith a side of Onion Rings and a Baked Potato.\nThe Ribeye was absolutely fantastic, it melted in your mouth like butter, The triple cooked chips were really crispy and I loved them. The Chimichurri sauce was on point as well. The Onion rings were super crispy and melted in the mouth also. The salad and Salmon had the perfect balance of salad, dressing and avocado. Along with the Salmon and Baked Potato, was a major hit for my wife. We were full this time and had no room for a pudding. Another great meal at Bar + Block and it was a pleasant experience with Waheed. Looking forward to our next visit."
    },
    {
        "name": "Bar + Block Steakhouse Glasgow",
        "rating": 3,
        "text": "We decided us spontaneous for this place.\nThere were almost to no customers, and yet our food came stale, almost cold and tasteless.\nWe ordered bruschetta as an entre, it was cold, dry and stale flat bread with tomato+old lettuce leaf.\nBurger buns were dry and cold. Burger patties were barely luke warm.\nThe fish was a tiny wrinkly dry piece, barely children's portion, with again stale flat bread.\nOn the positive side, service was nice and cocktails were ok."
    },
    {
        "name": "Malmaison Bar & Grill Glasgow",
        "rating": 5,
        "text": "While we were very disappointed with the menu the food we had was excellent and piping hot  The staff were very attentive"
    },
    {
        "name": "Malmaison Bar & Grill Glasgow",
        "rating": 5,
        "text": "Excellent food and service and the building is very cool, loved it."
    },
    {
        "name": "Malmaison Bar & Grill Glasgow",
        "rating": 5,
        "text": "Lovely relaxing place and great prices"
    },
    {
        "name": "Malmaison Bar & Grill Glasgow",
        "rating": 5,
        "text": "Thoroughly enjoyed our food. Service was attentive without being overbearing. Lovely surroundings. Highly recommended."
    },
    {
        "name": "Malmaison Bar & Grill Glasgow",
        "rating": 4,
        "text": "Sadly went in expecting the steak offer advertised in the bar only to be told it didn't apply after we ate it. Good service"
    },
    {
        "name": "Ox and Finch",
        "rating": 5,
        "text": "We ordered 8 dishes in total (3 people) and everything was very well-seasoned and delicious! 🤤\nHighly recommend the lamb shoulders, 🐑 buffalo mozzarella with kale, cod cheek and poached beam 🐟\nRump steak was okay 🥩 but we loved the sauce\nDessert looked beautiful and tasted surreal🥹\nService was quite quick and the staff were very friendly☺️"
    },
    {
        "name": "Ox and Finch",
        "rating": 5,
        "text": "We love this place - tapas style, small dish, price is reasonable to share in big groups (do come in big groups so you can try most of the menu - we regretted not having friends in Glasgow to try this). Definitely will come back!\n\nIt seemed like they have seasonal menu and change up the dish, so we didn't get the recommended beef caparccio. However, the rest of the menu piqued our interest.\n\nWe have:\n\n- Beef tartare (11/10): Presentation was ON POINT! The beef was sweet, umami, the egg yolk was light and airy, croutons added lots of crunchy character and made it so fun in the mouth to eat. The horseradish gave a fresh and refreshing taste. AMAZING!\n\n- Stone bass crudo (7/10): The fish was fresh, chewy, nice + paired well with the sauce. Definitely on the saltier side so we thought it would go well with some white wine. However, we don't like the hazelnut - it wasn't crunchy, the particularly hazelnut taste didn't blend well.\n\n- Spiced haddock (9/10): The spice was amazing + the SAUCE. We licked the dish clean.\n\n- Blood orange and fennel panzanella (9/10): The spice was amazing + the SAUCE. We licked the dish clean.\n\nEven at 4pm, the place still had 4-5 tables so definitely recommend reservations."
    },
    {
        "name": "Ox and Finch",
        "rating": 5,
        "text": "The perfect dining experience!\nThis was our second visit to Ox & Finch (the first in pre-Covid times) and it was just as we remembered it; outstanding from start to finish!\nEvery single dish we ordered was exceptional; you can tell that every dish has been thought through diligently and utilises the best ingredients with outstanding care to detail.  The recommendations from their excellent staff were amazing even though one recommended dish was out of my comfort zone it was perfectly balanced and tasted sublime - so thank you for making the recommendation.\nI doubt there is a better restaurant in the UK let alone Glasgow which compares with the experience and food at Ox & Finch - this is not hyperbole on my part, I have dined in everything from casual establishments to Michelin starred restaurants across the world and I, personally, think this is the best restaurant I've ever eaten in - I only wish I lived closer so I could do so more regularly.\nThe range of dishes allows for any and all palettes to be satisfied, we ordered a number of dishes (some pictured) and they all complemented each other; thanks to the recommendations.\nThe staff are very attentive without being overbearing and on this particular visit they went above and beyond which was very much unexpected but very much appreciated.  They engage when you wish to and leave you to enjoy in the perfect balance.\nI cannot recommend them highly enough, whether a local or on a visit to Glasgow make sure you book in for the perfect dining experience at Ox & Finch."
    },
    {
        "name": "Ox and Finch",
        "rating": 5,
        "text": "one of the best MICHELIN GUIDE restaurant!\n\nservice was the best, explained well on how the food will come (tapas style : out when its cooked) & described the menu well\n\nwe ordered :\n- fried artichoke (7/10) : mix of salty from the frying oil and sour from the yoghurt\n- duck liver parfait (9/10) : very delicious! savoury from the pate combined with the toast & berry jam\n- cod cheeks (9/10) : texture’s nice & a bit chewy just like scallop\n- grilled coley (4/10) : too salty for us unfortunately\n- slow cooked lamb shoulder (10/10) : MUST TRY! very delicious, lamb was very tender & juicy, combined with the herbs it was like HEAVEN\n- pan seared pork fillet (9/10) : delicious & tasty, pork is juicy & succulent\n- dry rump steak (9/10) : peppercorn sauce compliments the juicy meat\n\ni recommend u to reserve online before visiting as it gets crowded"
    },
    {
        "name": "Ox and Finch",
        "rating": 5,
        "text": "Went on a Friday evening. Had a really good time. The food was good and we loved the dishes. Great value for money and good portion sizes.\n\nI recommend the crab tubetti, rump steak, slow cooked lamb and the feta cheese flat bred, absolutely delicious.\n\nServer was friendly. If we are ever back in the city would definitely try again."
    },
    {
        "name": "The Buttery",
        "rating": 4,
        "text": "Good place, beautiful decoration, helpful staffs. Attended the wine dinner event last evening - the foods are all of good quality but not quite impressive. Although it’s an event of wine, I don’t really feel for the wine pairing. A good place if you wanna try traditional Scottish dishes!"
    },
    {
        "name": "The Buttery",
        "rating": 5,
        "text": "An institution. 150 years old restaurant. Waiting staff, excellent. Menu, good choice , mostly seafood. Quality of presentation and flavour, high. Mother-in-law has been in the restaurant business for fifty years and is very fussy about her fish but absolutely loved her fish main course. Thought there was a little too much potato in the seafood chowder but flavour good. The decor and atmosphere comfortable not stuffy."
    },
    {
        "name": "The Buttery",
        "rating": 5,
        "text": "Beautiful restaurant, with amazing Scottish food. The scallops were unreal. All the staff were lovely. The ambience was lovely and cosy. The food is such great value for money and great portions. They also gave lots of free bread and butter! and the bread was amazing! It was corn bread and sundried tomato bread when we visited. Wish i lived in Scotland so i could revisit soon!"
    },
    {
        "name": "The Buttery",
        "rating": 5,
        "text": "Excellent food, excellent service, a must try in Glasgow!\n\nThere’s literally nothing to complain about the food or service here! The scallops are the best I have ever had, cooked to perfection and generous portion as well! The sweetcorn purée goes perfectly with the scallops, you must try this dish!!\n\nThe five spice duck is super soft and tender, the noodle are a bit salty tho. Highland Venison is delightful as well, the red cabbage in it is so tasty. They do nice cocktails here as well! Even the bread tastes so good here 🤩\n\nThe service is absolutely amazing, everyone is so welcoming and friendly, love the decor as well, excellent atmosphere, there’s plenty of seating, highly recommend this place!"
    },
    {
        "name": "The Buttery",
        "rating": 5,
        "text": "Old school dining.  This place is mind-blowingly good. No sneaky service charges and no two hour dining slot. Refreshing to say the least. Food was superb. Nice portion sizes. Cannot fault this place and cannot wait to return. A pleasant surprise."
    },
    {
        "name": "Kcal",
        "rating": 5,
        "text": "Absolutely loved this place! Visited 3 times in 2 days. Staff were super lovely and the menu was fab.\nI was the only vegan in our group of 3 and was impressed with the available options, it was hard to choose. Both breakfasts I had The All American pancakes, super fluffy pancakes with mixed berries, granola and maple.... So good!\nFriends had french toast, granola bowl and smoothies and love it all.\nCoffee was delicious and the added bonus of the music was good on all 3 visits.\nCan't recommend this place enough.\nI'll definitely go back next time I'm in Glasgow."
    },
    {
        "name": "Kcal",
        "rating": 5,
        "text": "Delightful eating experience. Me and my daughter were in today. Lovely young woman said there was a ten minute wait but then found us a seat immediately. Delicious food at a very good price. Everyone smiling and welcoming. Highly recommended! (Keith and Amelia)."
    },
    {
        "name": "Kcal",
        "rating": 5,
        "text": "It's the best place for the yummy food and also healthy food I would say.\nThe staff are very friendly. I love the ambience.\nDefinitely worth going to. I highly recommend this place if you are looking to have a balanced diet food."
    },
    {
        "name": "Kcal",
        "rating": 5,
        "text": "Amazing place to eat a breakfast!\nWe ordered Heatlhy Start and Flower Power smoothie. Very delicious and I did it feel hunger after eating at all.\nAlso the interior design is pretty cool!"
    },
    {
        "name": "Kcal",
        "rating": 5,
        "text": "Food was stunning as always. Big smile and hello when I walked. In Lucy was great, super friendly."
    },
    {
        "name": "La Lanterna",
        "rating": 3,
        "text": "Went for a valentine's night dinner, and despite the high praises I have heard about this restaurant, the experience was pretty lackluster. The dinner service was restricted to their set menu for Valentine's day and one could opt for a 2 course meal for 27.50 each or 3 course for 35 each.\nMy partner ordered a mains and a dessert sharing platter, and I went for a prawn starter and mains. The menu did not state that if you share the dessert platter it will cost extra and after we were reassured by the service staff that it wont be charged separately, when it came down to the billing time, there was an extra 7.5 quid added on top of our 27.50 each. There was also an added service charge, automatically added on top of that, both seems disingenuous to me. I don't mind paying service fee and having worked in the hospitality industry I will gladly hand tips to servers, but this was not acceptable. The extra charge for sharing dessert platter makes no sense, 'cos essentially my partner paid 35 quid for a bowl of pasta and 4 shot glasses worth of desserts.\nWe were told that the server did not know and she explained it to us incorrectly that it would be included in the price, and only after asking for clarification was one given to us. She also quickly went on to say that she would be happy to take off the service fee, as if doing us a favor while admitting to the fact that she gave us misinformation while taking the order. The whole situation left a bitter after taste, although the main course pasta was pretty good. The dessert platter portion wise was very disappointing especially considering the extra charge.\nFood was decent, I liked my risotto but the whole billing experience did not leave me with a positive impression of the place."
    },
    {
        "name": "La Lanterna",
        "rating": 4,
        "text": "My wife and I had chicken and mushroom risotto, lasagna, and calamari for a starter. The risotto and calamari were great. The lasagna was good, too, but the sauce perhaps a bit burnt, giving the lasagna a smokie taste. The servers were attentive even with the large number of guests and the atmosphere cozy."
    },
    {
        "name": "La Lanterna",
        "rating": 5,
        "text": "I loved everything about this experience. The food was amazing, and the staff was friendly and knowledgeable. Plenty of options both food and drink. Clean restaurant and toilets.\nBest tiramisu I've had."
    },
    {
        "name": "La Lanterna",
        "rating": 4,
        "text": "Great place for a bite to eat. They were able to squeeze us in at short notice. Bruschetta starter was really nice. Main was good but not outstanding.. Desert (homemade tiramisu) was really good. Service was friendly and not overbearing."
    },
    {
        "name": "La Lanterna",
        "rating": 5,
        "text": "Since we were attending a concert,  we booked this restaurant about 3 months prior to our event and since there was 5 of us wanted to be guaranteed a table.\n\nThe menu choices were good, I went with the old classics however my friends all  chose different things and they all looked excellent and with empty plates at the end obviously tasted excellent 👌\n\nReasonable prices for the food and drinks we had.\n\nWill definitely be back if I'm in Glasgow again. 😀"
    },
    {
        "name": "Chaophraya",
        "rating": 5,
        "text": "I really enjoyed a fantastic meal here with excellent food of high quality. We ordered the set menu which was £43 per person. We got a very good mixture of starters, three main meals and rice, followed by a chocolate mousse for dessert.  The food was very very tasty. The building and restaurant area were exquisitely decorated all Thai themed."
    },
    {
        "name": "Chaophraya",
        "rating": 5,
        "text": "This was my first time here.  The food was great, the atmosphere was relaxed, all the staff were nice. Will be visiting again.  We went for the 3 coarse lunch menu. With a couple of add on's prawn crackers and 2 egg fried rice to accompany our main dishes and 2 large wines we paid £84 for 2 people."
    },
    {
        "name": "Chaophraya",
        "rating": 5,
        "text": "We stumbled upon Chaophraya while exploring Glasgow. It stands out as a gastronomic gem, offering the tastiest and most flavourful dishes we've ever had.\n\nThe authentic decor and vibes added an extra layer of enjoyment, creating an immersive experience that transported us to the heart of Asia. The genuine atmosphere complemented the outstanding culinary offerings.\n\nHighly recommend for anyone seeking an unparalleled Asian dining experience that combines exceptional flavours with authentic ambiance."
    },
    {
        "name": "Chaophraya",
        "rating": 5,
        "text": "Got vouchers for Christmas last year and finally went. Good selection of food and reasonable prices. We got the sharing platter as a starter and it was delicious. Got the specials for our mains a bit disappointed that you had to order rice or noodles separately"
    },
    {
        "name": "Chaophraya",
        "rating": 4,
        "text": "The entrance and interior decor of the restaurant are quite splendid, creating a fantastic ambiance. Booking a table in advance over the phone is very convenient. The flavor of the dishes is comparable to Ting Thai in the West End, but the prices are 2-3 times higher. This Thai restaurant in Glasgow is the only one offering Mongo Sticky Rice with Coconut Milk and Pineapple Rice, adding a unique touch. Lamb curry was average, and the portion sizes are rather small. A service charge of 12.5% is applied, which falls in the mid-range. The staff is reasonably friendly."
    },
    {
        "name": "Miller & Carter Glasgow",
        "rating": 5,
        "text": "Absolute quality, the food is phenomenal and service is second to none! Remember though…it is a steakhouse!!! The starter of sticky chipotle chicken is amazing, T-bone steak (medium/rare) is fantastic and apple crumble with custard is just excellent! Our server Ryan was extremely polite, helpful and very professional! The whole experience was amazing! 🌟 ⭐️ 💫"
    },
    {
        "name": "Miller & Carter Glasgow",
        "rating": 5,
        "text": "First time I've been .\nThis was a 1st date\nWe arrived early so sat next to the bar waiting on our table .\nVery busy evening\n\nFemale server was informative & attentive.\n\nToilets down steep stairs struggled a bit with high heels on however\nVery clean .\n\nThe steak was cooked to perfection peppercorn sauce  potatoes & fries tasty.\nCould not fault it\n\nThe white zinfadel (Rose) was a good accompaniment to the food.\n\nDon't know the cost as my date paid however the food was worth it .\n\nWould come back.."
    },
    {
        "name": "Miller & Carter Glasgow",
        "rating": 5,
        "text": "Stunning building, grand dining room and plenty of space between tables. Pleasant atmosphere and our server was lovely. Now the food. Possibly one of, if not, the best fillet steaks I've ever had. Also this was on a Sunday so it was about £35 per person for 3 courses, so good. Also the desert was delicious, the ice cream with mango sorbet and raspberry compote, comes in a shell of mango chocolate, highly recommend. Also the onion loaf is their answer to onion rings and I'm converted!"
    },
    {
        "name": "Miller & Carter Glasgow",
        "rating": 3,
        "text": "Overrated and disappointing experience.\n\nPositive: Service from staff is excellent. Atmosphere is fantastic. Food comes out very prompt compared to most places.\n\nNegative: The food is not the best that it so likes to boast about. Starters are tiny and had better steaks elsewhere (additionally; I asked for medium rare and got rare, partner asked for medium well and got medium). The main also is very sparse for a typical steak dinner, no vegetables as you need to choose between chips OR veg, why?! The most desolate steak dinner I have ever seen."
    },
    {
        "name": "Miller & Carter Glasgow",
        "rating": 5,
        "text": "The perfect date. Loads of prawns in the starter and our steaks were cooked beautifully, the food came out really quickly too. Long island ice tea was a 10/10! Shout out to our server Mags who was fantastic, really friendly, warm and very informative. Can't wait to return."
    },
    {
        "name": "Number 16 Restaurant",
        "rating": 5,
        "text": "My husband and I were wowed by our experience at number 16. It was our last meal of our honeymoon, and we wanted a really good dinner. I cannot say enough about this restaurant. The food was exquisite. Everything from the soup to the entrees, to the incredible lemon dessert thing! The service was excellent too! I wish I could remember our servers name. He was super tall with reddish hair. 20 some thing.\n\nI think one of the best references we can give is that we were sitting next to a party who were locals. Will locals as in three hours from the restaurant. They said that they never miss coming to the restaurant every time they’re in town. The next time we are in Glasgow, we will definitely make it back!"
    },
    {
        "name": "Number 16 Restaurant",
        "rating": 5,
        "text": "A great find thanks to the Michelin Guide, where Number 16 very much deserves to be. Lovely little place with very friendly staff, really delicious food (the cured sea bass to start was absolutely exceptional). Really glad to have found this place: highly recommend."
    },
    {
        "name": "Number 16 Restaurant",
        "rating": 5,
        "text": "My partner & I tried 2 starters, 2 mains and 2 desserts from their 3 course set menu. We love everything! From the service to the plating, and esp the careful & well put together pairing of fusion of flavours in each plate was simply divine. Highly recommended :-)"
    },
    {
        "name": "Number 16 Restaurant",
        "rating": 5,
        "text": "We discovered this wonderful restaurant today. We ate duck leg terrine, cured salmon, venison ragu, pork belly & coconut parfait. Every dish was perfectly balanced and totally delicious. This small, but perfectly formed restaurant, is a must visit! Great service & lovely intimate atmosphere."
    },
    {
        "name": "Number 16 Restaurant",
        "rating": 5,
        "text": "Out for our anniversary dinner..\nWe both agreed that this was probably the best food we have had in the Glasgow area.\n\nThe food was exceptional and the service matched the food..\nGreat little restaurant with reasonably priced delicious food.. We will definitely be back.."
    },
    {
        "name": "Wolf Italian Street Food Glasgow",
        "rating": 3,
        "text": "Tried this a few times for lunch. Food is ok and quick (if available )but they never seem to have any ready. Pasta is always needing to be made, salmon is never ready and usually \"5 mins\" which turns into 10.\n\nHas potential to be better  but it seems the owner is letting it down. Very bossy and demanding on her staff and service could be better. Staff look like they are being held against their will. Not sure what the story is.\n\nTaste wise it is ok when you compare v cost (city centre pricing)."
    },
    {
        "name": "Wolf Italian Street Food Glasgow",
        "rating": 3,
        "text": "OK for a quick lunch but... service is lacking . We were bundled together with another order and rushed through the process, so much so we had to ask if we could get some of the toppings.  Great idea but the meat and fish sit looking either dry or swimming in the prep boxes."
    },
    {
        "name": "Wolf Italian Street Food Glasgow",
        "rating": 1,
        "text": "They added a deal to itison to attract new customers then decided to close for “renovations”. Seen all the bad reviews prior to buying the deal but thought it worth the risk at £5 for a meal + drink. Walked all the way up there when I was in glasgow for the day to find them shut. Why agree to offering new customers an itison deal then close during the same time period. I guess the way this place is managed IS just as bad as how the other reviewers say it is"
    },
    {
        "name": "Wolf Italian Street Food Glasgow",
        "rating": 1,
        "text": "Owner doesn’t pay her staff, is quick to substitute ingredients for cheaper lower quality alternatives and is consistently rude to customers/staff while walking around the store with bare feet even in food prep areas. I would not recommend this restaurant as the food is overpriced and quality is lacking."
    },
    {
        "name": "Wolf Italian Street Food Glasgow",
        "rating": 4,
        "text": "Super quick service and a decent lunch for the price. Didn’t realized that the server was going to mix my dish (was quite excited for it unmixed) so that is something to note for next time."
    },
    {
        "name": "Glaschu Restaurant & Bar",
        "rating": 5,
        "text": "Sunday was an absolute delight with my partner! The experience was beyond wonderful. The waiter was very accommodating, a friendly and warm demeanor. The restaurant's ambiance struck the perfect balance between classy sophistication and a laid-back, relaxing vibe. Food and drinks - they were simply amazing, I wholeheartedly recommend this place with a resounding 100% and can't wait to return!"
    },
    {
        "name": "Glaschu Restaurant & Bar",
        "rating": 2,
        "text": "Have to say, slightly disappointed! This was a birthday present for me bought by my friends. Service was good, very attentive. Appetisers were probably the best thing about the meal, sourdough bread with chicken butter was lovely, as was the salmon cornet. I had roast of the day, the chicken was dry, Yorkshire pudding was rock hard and inedible. Desert of lime and coconut was just not nice at all. Far too sweet. Really wish I had not ordered that! My husband has beef which was very tough. All in all, I was very disappointed.  I had high expectations due to the reputation, but unfortunately, I would not return as this experience put me right off. Prices are far too high to have poor food! Vibes seem to be very posh, but the food needs to keep up with this or people will not return. Real shame!"
    },
    {
        "name": "Glaschu Restaurant & Bar",
        "rating": 3,
        "text": "A very nice restaurant with brilliant service from staff. The food was quite nice but I wouldn't really say amazing. Being blunt, it doesn't warrant the prices they charge. I've been to restaurants with more flavourful dishes for much less. Not sure I'd be going back here in future in all honesty."
    },
    {
        "name": "Glaschu Restaurant & Bar",
        "rating": 5,
        "text": "Location on the first floor of the western club Glasgow.\n\nbeautiful interior, low lighting and patterned carpet to the first floor.\n\nThe restaurant design is chic, modern.\n\nGood value 2/3 course meal with a discount if member of the western club.\n\nThe heritage tomato with goat cheese on puff pastry was excellent.\n\nThe coley with clams and sauce was also excellent. Coley was crispy on the outside and just done on the inside. Nice greens too.\n\nPinot noir was good.\n\nService attentive."
    },
    {
        "name": "Glaschu Restaurant & Bar",
        "rating": 3,
        "text": "Service was inattentive. Did not provide steak knives for venison. Server disappeared for smoke break. Banana bread for dessert tasted uncooked. Scallops were properly cooked. Serving sizes were misery. Disappointing experience."
    },
    {
        "name": "Stack & Still",
        "rating": 5,
        "text": "As someone who isn't necessarily the biggest fan of pancakes I was blown away with how much I enjoyed my visit on pancake day. The staff were excellent, the food was clearly made all in house and everything ate table of 4 had looked fantastic.\n\nI went for savoury pancakes with spicy chicken, avocado, Pico de Gallo, sour cream and avocado and it was simply sublime. I would go back in an instant.\n\nFantastic place and run incredibly well. Managers and kitchen staff obviously care about the place succeeding."
    },
    {
        "name": "Stack & Still",
        "rating": 5,
        "text": "Stopped in last month for our last breakfast meal while on our honeymoon and wow-- talk about going out with a bang! It was absolutely delicious! Wish we lived closer and could visit more frequently! The staff was wonderful as well, so kind, personable and attentive + the environment was cute and welcoming."
    },
    {
        "name": "Stack & Still",
        "rating": 5,
        "text": "Clean and trendy inside and a pleasant atmosphere all round.  Service was very good and always with a smile.  Pancakes are delicious - just beware they are very filling!  The Christmas special of a turkey stack was a nice touch and the pancakes went very well with it, bit like having Yorkshire Pudding with a difference.  Will be back again soon."
    },
    {
        "name": "Stack & Still",
        "rating": 5,
        "text": "I ordered the grilled aubergine stack but with gluten free pancakes. Pancakes were v good and the toppings had such a great mix of flavours. My partner had a side dish of spicy chicken fries but changed it to Chipotle Mayo- it was a huge portion. Both left very satisfied 😄"
    },
    {
        "name": "Stack & Still",
        "rating": 5,
        "text": "Came for a late brunch and had my first savoury pancake. I was super happy with my choice of pesto egg stack (sans mushrooms). Delicious and everyone else was really happy with their food too. Even the non-gluten pancakes, which I also tried and we're a bit chewier than with gluten, perhaps also because they're vegan."
    },
    {
        "name": "Ardnamurchan Scottish Restaurant & Bar",
        "rating": 5,
        "text": "According to the recommendation on the Internet, I came to this restaurant for my lunch in Glasgow. This restaurant has a unique set menu during lunch time, two courses is £19.95, three courses is £22.95. Because I don't want to eat dessert, I just order a Oven Baked Lamb Stovies for starters and a Ardnamurchan Estate Braised Wild Venison Stew for mains. The starters - Lamb with a piece of cheddar cheese stewed very soft, and it's delicious with its tangy tomato flavor and baked aroma. The mains - venison stew is rich in side dishes, and the mushrooms and potatoes have a unique taste when paired with the venison. The only downside was that the venison wasn't tender enough, but that was the problem with the venison and not with the restaurant processing it poorly.\n\nI also ordered an oyster, which cost £3. If ordered 6 oysters, it would be £15.  The oyster has a small size but absolutely fresh. Worth to try.\n\nOverall, this restaurant serves very good food.  If you come to Glasgow, please come and try this restaurant!"
    },
    {
        "name": "Ardnamurchan Scottish Restaurant & Bar",
        "rating": 4,
        "text": "If you are looking for authentic, hearty, well plated Scottish food look no further. It’s a showcase of local produce in an upscale and well dressed dining area.\n\nPortions and menu can’t be faulted on this visit but the service felt a bit underwhelming for a special occasion but Im willing to bet that might just be a post Xmas hangover and an off night.\n\nIt’s maybe more formal than some other eateries but it hits all the right notes in culinary craft. A thoroughly satisfactory spot to impress your friends or visitors."
    },
    {
        "name": "Ardnamurchan Scottish Restaurant & Bar",
        "rating": 5,
        "text": "We've been on vacation in Scotland for 10 days and while we've had some great meals,  this one topped them all!!  The Cullen Skink, to quote my Glaswegian born spouse was 'the best I've ever had'.  The fish & chips and the sirloin with peppercorn sauce were fantastic.   The sticky toffee pudding was superb!  The wine list is good.  The cocktails were lovely - try the Orange Chocolate Espresso Martini!  The service was outstanding - thank you Grier!"
    },
    {
        "name": "Ardnamurchan Scottish Restaurant & Bar",
        "rating": 4,
        "text": "Staff was very nice and attentive!\n\nFood: The scallops were super fresh and delicious! The goat cheese salad was also quite nice. The lambo shank wasn’t that great - the dried out broccoli was nice though. The best was the chestnut risotto and the sticky toffee pudding. Those two dishes I’d recommend in a heartbeat!"
    },
    {
        "name": "Ardnamurchan Scottish Restaurant & Bar",
        "rating": 4,
        "text": "I asked for a medium rare steak, but I got medium well. I wasn't happy about it\n\nIt was my wifes birthday and the first time Scottish restaurant . It was a beautiful and very nice experience . The cocktails were nice\nEspresso matini made my wife's day .\n\nThe fish soup was fantastic\nHaggis was beautiful and earthy\n\nMy wife's venison was cooked to perfection\n\nSticky toffee pudding was to die for. However, there was a pitt of date in one of the bites.\n\nIn all, it was good"
    },
    {
        "name": "Red Onion",
        "rating": 5,
        "text": "Been meaning to eat here for several years, having tried the food at a BBC Good Food exhibition. My wife's lactose intolerance was a non-issue. We had the pre-theatre fixed price menu (she had the dairy-free version, including a banana fritter). Loads of choice, delicious food, and the service was terrific. The chef even dropped by our table to say hello. Next time we are visiting Glasgow we will definitely be back"
    },
    {
        "name": "Red Onion",
        "rating": 4,
        "text": "A very cute place. They closed their full menu earlier than their hours indicated. We were able to order from apps and salads. The food was pretty good. It was all cooked well and served prettily. Bathrooms were clean. Service was minimal and mostly forgot us. I couldn't make eye contact with a server to save my life, so it was a pretty thirsty meal for me. Mostly just enjoyed the ambiance. I'd head somewhere else if I was choosing again."
    },
    {
        "name": "Red Onion",
        "rating": 5,
        "text": "Beautiful restaurant. The food is absolutely delicious and it's a lovely atmosphere. Really great service even when busy."
    },
    {
        "name": "Red Onion",
        "rating": 5,
        "text": "Food superb, one of the best gluten free / coeliac friendly menu options I seen\nStaff were lovely &friendly and very attentive but not over bearing so\nWe would  definitely revisit next time we are in Glasgow"
    },
    {
        "name": "Red Onion",
        "rating": 4,
        "text": "A lovely small restaurant tucked away on a quiet street close to the city centre. I had lunch with friends and we all enjoyed our food. The waitress went out of her way to accommodate what we wanted, which was a bit different to the usual order of courses. They have a good selection of wines by the glass   and wine to suit all budgets. We won't leave it so long until we go back again."
    },
    {
        "name": "Six by Nico Finnieston",
        "rating": 5,
        "text": "Fabulous experience sampling The Mad Hatter's Tea Party menu. When each course is served it's expertly explained by serving staff and accompanied by a little theatre.\n\nAbsolutely delicious food served in beautifully decorated surroundings. I have read some reviews indicating that the tables are extremely close together. This is true but we didn't find it overly intrusive. Overall a fantastic experience."
    },
    {
        "name": "Six by Nico Finnieston",
        "rating": 5,
        "text": "Thoroughly enjoyed our dinner here. All 6 courses were very tasty, and we thought the wine tasting was fab. Took around 2 hours but did not feel like that at all!"
    },
    {
        "name": "Six by Nico Finnieston",
        "rating": 5,
        "text": "Visited here as a treat as it is a bit pricier than some of the local restaurants, but I've wanted to go for a while, and honestly it didn't disappoint. The restaurant is small and usually fully booked, so getting a walk in is unlikely. The staff are attentive and polite without being overbearing. The Thai fusion menu was the theme when we went, the food portions are small, but it is a tasting menu, you are there for the experience, not to get stuffed full. I thought the food was delicious and creative with lots of different elements making up each dish. Being a bit of a fussy/limited eater I wanted to try foods I wouldn't normally eat, and the pumpkin spring roll gave me a whole new appreciation I didn't know was possible for pumpkin. I normally don't eat fish either, but the pan seared bass has completely changed my mind. If you want something a bit different to treat yourself, with a friendly and relaxed atmosphere, then definitely try this place."
    },
    {
        "name": "Six by Nico Finnieston",
        "rating": 3,
        "text": "I love the idea of Six by Nico. But if you aren’t keen on one or two courses it feels expensive for the rest of the meal.\n\nDishes were well cooked, albeit not very hot, but well presented and full of interesting flavors.  I don’t like service change included on the bill, (although it’s optional) nor the charity donation."
    },
    {
        "name": "Six by Nico Finnieston",
        "rating": 5,
        "text": "Great experience!\nI came here with my family and had a great time. The service was fantastic, the vibe was very happy and excited and the food was good.\nThe dishes were very creative, interesting to look at tasty.\nWe all had the matching wines which paired very well. There was a matching cocktail for your first drink which was a nice change as well.\n\nTasting menu, matching wines, 4x extra cocktail and 2x extra snack course was around £360 for 4 of us.\n\nHad a great time with my family but don't have any intentions coming back for a while, not sure why, just left a little underwhelmed by the flavours."
    },
    {
        "name": "Gamba",
        "rating": 5,
        "text": "The fish soup (crab meat with ginger and coriander) is amazing. Crispy fried stone bass tastes well, especially with the lettuce salad.\nThe warm sticky toffee pudding tastes too sweat, not recommended."
    },
    {
        "name": "Gamba",
        "rating": 5,
        "text": "Been coming here for years.  One of my favourite restaurants. If you enjoy fish dishes this place is great, lots of delicious choices. The service is really good, very nice ambience, really enjoyed their fish soup with prawn balls."
    },
    {
        "name": "Gamba",
        "rating": 3,
        "text": "The chef and I must have different tastes. My main course, Halibut in Cullen Skink sauce, came with a substantial amount of smoked haddock. It had a powerful flavour. I would have enjoyed Halibut much more if there wasn't smoked haddock at all. Panna cotta wasn't appetizing either. We had a great seafood dinner elsewhere in the city centre for a much lower price so our expectations were not met."
    },
    {
        "name": "Gamba",
        "rating": 4,
        "text": "Luxurious fine dining experience in Glasgow. The food was great, and the service fantastic. However, be ready to spend a pretty penny, we spent over 350 pounds for 7 people. We thought that Halibut and the Monk Fish were fantastic, although we would have preferred a tad more Halibut on our dish considering the high price tag. Overall a good experience."
    },
    {
        "name": "Gamba",
        "rating": 5,
        "text": "Loved the food. Really tasty fish soup to start. Sea bream was excellent. Good choice of wines to accompany our meal. Pleasant setting and friendly staff. Keen to get back again soon."
    },
    {
        "name": "Ocho",
        "rating": 4,
        "text": "Place is really cute. Doesn’t have parking which made it a little difficult to access as we had to find parking then walk there. But it’s a nice walk! The wait staff attention to detail could be better. Had to remind twice for water, I asked what a couple things on the menu were and they weren’t sure. I was given no cutlery when I got my meal which I had to ask for. The atmosphere was lovely. And the food ok. I made the wrong choice! The Dog menu is a cute touch!"
    },
    {
        "name": "Ocho",
        "rating": 5,
        "text": "Some of the best food nice have eaten for a long time.. Great staff.  Nice location, by the canal. Parking is tricky but we got a space. The crispy kale was amazing. Steak sandwich was outstanding.  And my hot smoked salmon, avocado on sour dough toast with poached eggs. Was also outstanding.  Free water to the table. Coffee was first class so was the pot of tea. Booking recommended."
    },
    {
        "name": "Ocho",
        "rating": 5,
        "text": "Finally visited Ocho as it's been on my list to visit since moving to Glasgow years ago. It is a cute small place. Stunning views of Glasgow and a nice canal walk just at the front. Not the easiest place to get to but worth a visit"
    },
    {
        "name": "Ocho",
        "rating": 5,
        "text": "THE WHOLE PACKAGE!\nOcho has it all for me - well presented tasty food at a reasonable price, genuinely lovely, engaging staff....and an incredibly scenic location.\nI love it and recommend it."
    },
    {
        "name": "Ocho",
        "rating": 5,
        "text": "Food is good but the service and staff is excellent.\n\nLondon Fog (earl grey with milk froth) was tasty.\n\nMake sure it’s not a date if you’re going for the Turkish Eggs. Decent garlic!\n\nBuild your brunch is the best!\n\nDefinitely would go back for more."
    },
    {
        "name": "The Gannet",
        "rating": 5,
        "text": "Fantastic tasting menu and matching wine. Smashing service with dishes and wines being explained. All the dishes were great, tasty and leaving you wanting some more. Matching wines we very good, great selections from Eastern Europe, some you just would t expect. We also added a fantastic cheese course and took a vegetarian option, instead of the beef tartare… service was excellent in this regard, nothing was a problem. Great night all round. We’ll be back for more."
    },
    {
        "name": "The Gannet",
        "rating": 5,
        "text": "An unbelievable experience! The food was utterly sublime, with every bite being a taste sensation. We took the 6 course tasting menu, as was an afternoon sitting, we didn’t choose the wine pairings. The cocktails were amazing, from a new twist on an old fashioned to the pink fizz!\nThe staff were great, they explained every course in detail and were very attentive throughout and we never felt rushed, even though we were there for over 3 hours.\nBrilliant food in a lovely setting, we can’t wait to return!"
    },
    {
        "name": "The Gannet",
        "rating": 5,
        "text": "I’ve been there twice - one for tasting menu and another for Burn’s Night, and I do recommend everyone to come as they are quite amazing! From cocktails, wines, foods to the coffee after meal, I cannot tell which one is the best because all of them are impressive!"
    },
    {
        "name": "The Gannet",
        "rating": 5,
        "text": "The whole experience was amazing. The staff was very friendly and professional. The food was great, never tasted everything better. The drinks where very tasty as well. Definitely will come back.\n*Thank you for the one of the best food experience of my life*"
    },
    {
        "name": "The Gannet",
        "rating": 5,
        "text": "Received a voucher for my birthday. Was an amazing meal! Food was top notch. Well deserved of the 3 rosettes. Servers were pleasant and knowledgeable. Only thing I would say re the service (and this is me being picky), sometimes if one of us got up to the bathroom, we would come back and our plates were already served which meant we missed out on the explanations, and also clearing bread cutlery away whilst we were eating the next course. This didn't detract from the overall experience though and feel like tiny little tweaks to the service would get them to a Michelin star."
    },
    {
        "name": "Santa Lucia Merchant City Glasgow",
        "rating": 5,
        "text": "It was our first visit to Santa Lucia Merchant City and definitely won't be our last! The food was incredible! Everyone enjoyed every dish from starters, pastas, pizzas and desserts. The service was very friendly and attentive and the atmosphere is really lovely. We had a great dinner thank you!"
    },
    {
        "name": "Santa Lucia Merchant City Glasgow",
        "rating": 5,
        "text": "There is something about this restaurant that feels very authentic Italian from looking outside to the minute you step in. It's refreshing. The decor is traditional and modern at the same time and the atmosphere is great. We all thoroughly enjoyed our food which was delicious and fairly priced. Our servers were all very friendly and fast, my only criticism was that sometimes it was difficult to get their attention as it was busy when we went. Otherwise though I would recommend this place"
    },
    {
        "name": "Santa Lucia Merchant City Glasgow",
        "rating": 4,
        "text": "Dreamy romantic place with hues of blue, yellow and white tiles for that Tuscany feels! Great courteous staff:)\n\nPros: Reasonably priced. Decent taste. Bruschetta had an onion puree which I thought was a unique touch. Loved the Oreo Cheescake and Brownie with ice cream!\n\nCons: Limited vegetarian options. Not much scope for customization"
    },
    {
        "name": "Santa Lucia Merchant City Glasgow",
        "rating": 5,
        "text": "Food was excellent & service was outstanding without being too intrusive. My OH's prawns tasted like they had come straight out of the ocean. 2 mains,2 drinks,coffees & a starter for £65 these days is a bargain."
    },
    {
        "name": "Santa Lucia Merchant City Glasgow",
        "rating": 5,
        "text": "Amazing restaurant!! Gorgeous cosy vibes & the staff were so friendly, in particular our Italian waiter a young gentleman who was so so attentive and kind. Food was delicious and they had a live singer who was just fabulous! To top it off the food was absolutely delicious, highly recommend!"
    },
    {
        "name": "Piccolo Mondo",
        "rating": 5,
        "text": "£14.5 for 2 course. I chose main and dessert.   I ordered cheese cake . It is too creamy and not much cheese taste. A bit disappointed.\n\n2nd visited for dinner on 28Dec 2023.\nWe chose the Pre-theatre Mena. We ordered starter and main course. Everything is good. I like the prawn cocktail and calamari fritti."
    },
    {
        "name": "Piccolo Mondo",
        "rating": 5,
        "text": "Absolutely fantastic place food is delicious and staff are pleasant and friendly"
    },
    {
        "name": "Piccolo Mondo",
        "rating": 5,
        "text": "Authentic Italian in downtown Glasgow.  They took our party quickly on a busy night without a reservation.  The service was attentive through a group effort.  The food was delicious and truly authentic.  The minestrone soup was perfect.  Fresh vegetables, served hot, with just the right amount of salt.  The slices of haggis and black pudding was surprisingly tasty for my first time.  Don’t ask what it is made of, just try it and you will find an unusual, but pleasant flavor and texture.  The medallion of veal fillet alla Milanese was a tender, hearty portion of veal pounded thin, coated in light breading, and served hot.  Delicious from the first bite to the last.  The table next to me ordered the lyonnaise potatoes and they looked so good I had to order them as well.  They were superb and tasted as good as they looked.  Welcoming, charming place with more than reasonable pricing especially on the alcohol.  Must visit if you like Italian."
    },
    {
        "name": "Piccolo Mondo",
        "rating": 5,
        "text": "Went to Piccolo mondo for a two course lunch + drink for two with an itison voucher.\nHaven't been here for years and didn't disappoint. Staff were very friendly, and the service was first class. The food was great, fresh, and very tasty. Definitely be back. ❤️👌✔️"
    },
    {
        "name": "Piccolo Mondo",
        "rating": 5,
        "text": "Just had lunch there. The most amazing food I've ever had. The staff was also very nice. I would go 7 days a week. The food was so good I almost cried❤. My friends and I had the pasta bolognese, the lasagna and the grilled seafood platter. Very lovely!"
    },
    {
        "name": "Sugo Pasta",
        "rating": 5,
        "text": "With no booking we only had a short wait for a table for 2 of us and a pram even though it was very busy on a Friday afternoon. Small menu but food was absolutely amazing. Good portion sizes and service was very quick."
    },
    {
        "name": "Sugo Pasta",
        "rating": 5,
        "text": "Food is delicious. Service very fast, lovely decor and surroundings. My only complaint is that the waiting staff tended to linger and continually come over to the table which was put people on edge, I noticed other tables around me saying the same thing. Folk just want to be left to eat in peace so this would be my only bit of feedback."
    },
    {
        "name": "Sugo Pasta",
        "rating": 5,
        "text": "30 min waiting was worth it. One of the best selection of pasta, amazing service, perfectly cooked dishes and delicious desserts. A perfect place for Italian food !"
    },
    {
        "name": "Sugo Pasta",
        "rating": 5,
        "text": "Best pasta I've ever eaten in my life. Quick, efficient, no frills, no substitutions, absolutely mint at what they do. Table of 6 in and out in 45 mins, including the wait for the table."
    },
    {
        "name": "Sugo Pasta",
        "rating": 4,
        "text": "We were a big group of 9, so we went early around 12 noon and were seated within a few minutes (it got crowded very soon after). The place is big, casual and gets noisy during a busy service, but that's part of the vibe. The menu had around 10 pastas to choose from. The pasta itself was ok, not al dente enough to my liking, but this seems to be the case with some freshly made pasta. The sauce was a bit tart but rather tasty, without being overly seasoned with herbs. Flavours are quite similar to homemade pastas I've had in Italy. Overall a good experience, but don't go with terribly high expectations, you won't get top standard luxury fare here."
    },
    {
        "name": "Bothy Glasgow",
        "rating": 5,
        "text": "I went here for the Burns night with a friend and it was a spectacular evening, the atmosphere was wonderful, the staff were really good and attentive.\n\nThe food was great but not to the standard I would have expected for a higher end restaurant. I loved the haggis, neeps and tatties though the ham hock & lentil soup was just OK. The cranachan cheesecake was quite nice. My friend loved her salmon starter though felt the sticky toffee pudding was a bit heavy. She also thought the haggis was delicious.\n\nThe whisky flight was very good value for money considering the price of the bottles, I had the Isles one and would recommend it. We also had a few bottles of red wine, the cheaper ones tasted better than the more expensive bottle.\n\nI'd definitely go back but would try other options on the menu along with another whisky flight 😀"
    },
    {
        "name": "Bothy Glasgow",
        "rating": 4,
        "text": "I feel this is a place that rests on their laurels and could use some rejuvenation. The food mains were good, but somewhat salty on the sides and veg. The service was definitely lacking in promptness. Our mains came out nearly 1.5h after arriving (we had starters)."
    },
    {
        "name": "Bothy Glasgow",
        "rating": 4,
        "text": "It’s a lovely restaurant area and the staff are very pleasant. The menu has several vegetarian and vegan 🌱 options which is great, but I think the quality of those courses is probably a bit below the meat dishes.\nSunday roast is good."
    },
    {
        "name": "Bothy Glasgow",
        "rating": 5,
        "text": "Really friendly staff, really fancy and tasty food. All arrived quickly. Really nice renovation since was last here. Definitely recommend. Is a little pricey but it’s definitely worth it as a treat as it reflects in the food and decor."
    },
    {
        "name": "Bothy Glasgow",
        "rating": 5,
        "text": "This is the first time we have visited for many years after tonight’s meal I really can’t understand why we waited so long! Everything was lovely and from my point of view nearly everything was Gluten Free. This is because they create their own sauces and reduce to thicken to enhance the flavour rather than add flour. The menu has game meat on the menu. I had smoked duck starter followed by venison ( see photos). Then my ultimate treat Gluten Free sticky toffee pudding. Our next visit will be soon, no way am I going to leave a long gap like last time 😎"
    },
    {
        "name": "Roma Mediterranean Restaurant",
        "rating": 2,
        "text": "Beware of expensive add ons!! The portions are decently sized but the food is so extremely bland. I had the chicken carbonara and the chicken tasted old and chewy. The carbonara had no taste at all and I had to heavily salt it to make it edible. The pollo al Pepe and the steak were so average for the prices we were paying. The garlic bread also had no taste whatsoever. The cocktails were delicious but often the food would come before the drinks. However the staff were nice and the atmosphere was cute. Such bad value for money as the prices were absolutely extortionate!!"
    },
    {
        "name": "Roma Mediterranean Restaurant",
        "rating": 4,
        "text": "First time visit to Roma Mediterranean Restaurant and was actually surprised at how big it is inside. It's a bit like a Tardis! Hadn't booked but there were plenty of tables available. Nice decor and the atmosphere was pretty good. Nice little booths where you can sit and chat easily without being overpowered by noise from elsewhere. Food was all good and very tasty. The only downside for me was the automatic addition of a 10% gratuity to the bill. I usually like to decide for myself if the service was worthy of a tip. Overall though I would recommend it as the food was really nice. 👍🏻"
    },
    {
        "name": "Roma Mediterranean Restaurant",
        "rating": 3,
        "text": "The place was good, service was amazing, we ordered pizza and garlic bread. but the pizza crust was overcooked. The garlic bread was lacking flavours."
    },
    {
        "name": "Roma Mediterranean Restaurant",
        "rating": 4,
        "text": "Really nice restaurant. Service was very good and I enjoyed the food."
    },
    {
        "name": "Roma Mediterranean Restaurant",
        "rating": 5,
        "text": "I went here for my birthday dinner with my wife. Booked it on 5pm deal. Staff acknowledge this straight away. Got a lovely table brought out our wine and asked if we wanted some water. We ordered starters and an amazing steak. I had the Diane sauce which was amazing and my wife had the red wine sauce. I would defo go back. Tip is already put on your bill. The 5pm deal was 2 course Sunday to Wednesday with a bottle of wine £49.25.\nThank you"
    },
    {
        "name": "Cail Bruich",
        "rating": 5,
        "text": "The ingredients were exceptional.\n\nBeautifully presented in both plating and ability to allow flavour to shine.\n\nCourses were correctly portioned to ensure a smooth tasting experience.\n\nThe casual ambience is matched by the relaxed front of house staff. They read us well and we enjoyed our conversations with them.\n\nHighly recommended. It's obvious to see why the Michelin star hangs here."
    },
    {
        "name": "Cail Bruich",
        "rating": 4,
        "text": "Great service and atmosphere.\nLoved the food - only downside was that two dishes had similar flavour profiles to when I last went in 2021- the main, and the last dessert. The main, which was grouse - just a bit too hearty for me, and was seasoned with 5 spice, which was similar to the duck dish in 2021. The dish was very similar to what I had at the Balmoral earlier in the year... and I had the same issue with that as in, it just needs something to break up the richness of the protein. The dessert was milk and honey, was yummy, but just very similar to the 2021 flavours. The real star of the show for me was the mushroom dish with brioche ... was excellent. The service was spot on as to be expected.\n\nBest wishes. M"
    },
    {
        "name": "Cail Bruich",
        "rating": 5,
        "text": "The attention to detail is outstanding. From the servers, to the food itself. I thought I would be hungry when it was over but the courses were just enough for lunch. If you want a true world class dining experience, you go here. You will not be disappointed."
    },
    {
        "name": "Cail Bruich",
        "rating": 5,
        "text": "I was there for the tasting menu with my wife for her birthday and it was simply superb. Every part of the experience from the hard working and knowledgeable staff, who make each of the exquisite and beautifully prepared courses, made to perfection from the extremely hard working and expert chefs in the kitchen with Lorna, with the just the right amount of discrete theatre at the table to make them both exciting and memorable. The attention to detail and craft for each dish component is amazing and the Michelin star is well deserved. We absolutely loved it and will certainly return. Fantastic."
    },
    {
        "name": "Cail Bruich",
        "rating": 5,
        "text": "Worth the 1* Michelin Guide.\nIncredible food, as well classic and reinvented, perfect service from a well-rehearsed team.\nIt wasn't the first time I've eaten there and certainly not the last!"
    },
    {
        "name": "Osteria Glasgow",
        "rating": 4,
        "text": "Osteria is located at 17 John Street, Glasgow (within Merchant City).  It's a 10 to 15 minute walk from Glasgow Central.\n\nThe food we ordered was lovely. We had the chicken burger with fries and spaghetti carbonara (the carbonara was quite creamy), with bruschetta classica. For dessert, cheesecake of the day (it was lemon, very soft and airy). We also had a banana split. Big thumbs up!\n\nThere were two nice members of staff alternatively waiting on people. The restaurant layout itself is very welcoming. The main part is probably the best area for people who may have any mobility problems. To the left and right of the bar, going up a few steps, you'll find seating. There is a very spacious disabled toilet located to the right of the bar area. It was spotless.\n\nAccessibility to the upstairs part of the restaurant and the ladies and gents toilets is via a spiral staircase. Again, the toilet facilities were gleaming.\n\nI think this restaurant may be dog friendly as well.\n\nContinuing on a canine theme, the S.O.T.B cocktails were the puppy's bow wows!!!! I would go to this restaurant again."
    },
    {
        "name": "Osteria Glasgow",
        "rating": 4,
        "text": "🍕🍝 Stepped into this Italian joint Osteria in Glasgow, that had me feelin' like I just stumbled into a scene from The Godfather!\n\n💼 The atmosphere was as authentic as a Sicilian grandma's secret recipes, and the joint was bigger than Don Corleone's empire! 💼🏛️ They've got more pizza and pasta variations than mob bosses have aliases – capisce? 🍕🍝 And let me tell ya, the music was thumpin' like a beat-up Cadillac cruisin' down Mulberry Street! 🚗🎶\n\nNow, the cheesecake, fuhgeddaboudit! It was as big as a suitcase full of cash, but sweet enough to give a rival sugar rush!\n\nBut let's talk 'bout that colossal calzone – it was so massive, I half expected a violin case to be smuggled inside! 🎻 And the price? Let's just say it's an offer you can't refuse! 💸 Now, the food prep time, it was quicker than a getaway car at midnight – 14 minutes flat, no funny business. ⏲️🌃"
    },
    {
        "name": "Osteria Glasgow",
        "rating": 5,
        "text": "I came here the other week with a friend. My only qualm was I couldn't finish my main course because I wasn't feeling well! Staff were attentive and helpful, food was lovely and reasonably priced. Will definitely be back"
    },
    {
        "name": "Osteria Glasgow",
        "rating": 5,
        "text": "Wonderful Italian restaurant! The food was great, the staff were attentive and the place itself is lovely. Would highly recommend."
    },
    {
        "name": "Osteria Glasgow",
        "rating": 4,
        "text": "Lovely little Italian restaurant in the heart of Glasgow city centre. Very polite staff and very good food. Fast service coupled by home made Italian food, what more do you want. Also recent award winners! Give it a go, you won't be disappointed."
    },
    {
        "name": "Ka Pao Glasgow",
        "rating": 5,
        "text": "Outstanding.  My general rule is if I do not understand the menu items, I do not eat at the restaurant.  This place is one of the few exceptions.  It was chosen by my friend at the recommendation of a local.  The menu is unique and contains many flavor profiles and items that I have never experienced.  We trusted the chef and went with the sharing menu.  The chef is a real artist who put together robust flavors of seemingly strange or unknown ingredients that really complemented each other.  Dont overthink it.  Have a little faith and try these unique creations.  This is New York, LA, Vegas, Paris quality food in Glasgow.  Plenty of food and reasonably priced."
    },
    {
        "name": "Ka Pao Glasgow",
        "rating": 5,
        "text": "So glad to have come across this restaurant! I love the concept; which is to a order small selection to share (great if you’re not feeling too hungry and if you want to sample multiple dishes). Definitely recommend the fried chicken, which was so crispy outside and juicy inside, the curries were spot on and deserts were amazing. The staff was great at explaining everything and was very quick to serve us. Definitely would love to come back here again to sample out other items on the menu! 🥰"
    },
    {
        "name": "Ka Pao Glasgow",
        "rating": 5,
        "text": "Omg the food is amazing! I can be a bit nervous about trying new foods but virtually every dish (my group basically passed around every dish we ordered so we could all try it) was amazing! The oyster mushrooms in particular were delicious. The staff were so lovely and patient. The entire setup of the restaurant is so pretty.\n\nMy one complaint would be that I hated paying £4 for a glass bottle of coca-cola 🤣 but honestly everything was so lovely. I'll definitely be back."
    },
    {
        "name": "Ka Pao Glasgow",
        "rating": 5,
        "text": "So many dishes too choose from & reasonably priced. I went with my brother and we shared 3 dishes each, which is the optimal amount.\n\nService was very kind & attentive to our table."
    },
    {
        "name": "Ka Pao Glasgow",
        "rating": 5,
        "text": "\"Ventured into the heart of Glasgow's West End to discover Ka Pao, and it's safe to say, this place left an impression! Nestled in a prime location, it boasts a spacious interior with a welcoming atmosphere.\n\nThe staff here are aces – speedy and ever-helpful, they make you feel right at home. And let's talk cocktails – they don't disappoint!\n\nNow, onto the grub. For a starter, I tried the salt and Szechuan pepper oyster mushrooms with pickled mooli (vg). It was an explosion of flavors! The mushrooms were perfectly crispy on the outside, tender inside, and that soy lime sauce? A symphony of tastes in every bite.\n\nI wondered if the main course could match up, and I went for the hispi cabbage with cashew nut butter and sriracha. The butter was a delight, melting into the cabbage, but the sriracha had a bit too much swagger, making the dish a tad on the salty side.\n\nFor dessert, I wrapped up with the coconut pandan and mango calamansi. It was a tropical paradise on a plate! Nutty flavors danced with the freshness of mango, and it was an absolute delight.\n\nWith an experience like this, there's no doubt – I'll be back for more!"
    },
    {
        "name": "Las Iguanas - Glasgow",
        "rating": 5,
        "text": "Monica was lovely. This was our first meal out since getting married and she was super friendly. Service was very quick and she was very attentive, always checking on us for drinks and making sure our food was good. We are very happy! And can't wait to return. Thank you! She even gave us a glass of prosecco to congratulate us which I thought was a lovely touch."
    },
    {
        "name": "Las Iguanas - Glasgow",
        "rating": 5,
        "text": "Very big space with an impressive variety. Love the fact that they put calories on the menus. And if you check the online menu you can even find the macros for the dishes. So rare! So useful!\n\nHad 🐔 fajitas that were very tasty and fresh."
    },
    {
        "name": "Las Iguanas - Glasgow",
        "rating": 4,
        "text": "We went on a Tuesday night, so it wasn't busy, but they do have a ton of seating. The atmosphere was amazing, and so did the interior. The wait on drinks and food wasn't too long. Food wise, I think it's a little overpriced for the quality and amount, but it's still good. The cocktails, though, are delicious. I definitely recommend the mango collins. The staff was also very polite"
    },
    {
        "name": "Las Iguanas - Glasgow",
        "rating": 5,
        "text": "Food was absolutely delicious, we ordered 6 tapas dishes to share and every single one was amazing. Would definitely be back. We also turned up half an hour early on the off chance we could be seated early and they managed to squeeze us in. Staff all lovely and helpful."
    },
    {
        "name": "Las Iguanas - Glasgow",
        "rating": 4,
        "text": "Always love coming to Las Iguanas. Great cocktails, fab food, although one of my favourite sides has now changed. Usually get the roasted cauliflower, which is dusted and roasted to perfection with spices, however on this visit, the cauliflower is now tiny little pieces dunked in a thick stodgy batter. So your getting half the amount of cauliflower and a bug bowl full of batter, to be honest it's unrecognisable as cauliflower.Very disappointing, these dishes are expensive for what they are, but usually worth it for the flavour, but not in this case. Bring back the original recipe. Cocktails amazing as and service with a smile from our bearded server, who couldn't do enough x"
    },
    {
        "name": "Halloumi Glasgow",
        "rating": 5,
        "text": "Excellent food, beautiful interior and great service. The food was ready fast. The only complaint is that the table surface was sticky, even the napkins were stick to the table because of stickiness.\n\nWe tried chips with Halloumi, Lamb Moussaka which were both good and Lamb chops, the lamb chops was one of the best chops I’ve ever had."
    },
    {
        "name": "Halloumi Glasgow",
        "rating": 5,
        "text": "Food was amazing. Highly recommend the feta tempura, was sooo good. The gyros was great also. The music was good and the staff were really friendly. Will return again"
    },
    {
        "name": "Halloumi Glasgow",
        "rating": 4,
        "text": "Lovely high quality Greek food from a very broad menu. We were a group of 6 celebrating a birthday.\nService was very friendly from very polite and attentive staff.\nWasn't cheap and the wine was a bit over priced.\nWe were in on a Sunday afternoon in January,  so it wasn't busy, bit quiet, no great atmosphere.\nAll good though. Really enjoyed it and will definitely go back."
    },
    {
        "name": "Halloumi Glasgow",
        "rating": 5,
        "text": "First visit. Will definitely be going back. Food was delicious. Staff were lovely."
    },
    {
        "name": "Halloumi Glasgow",
        "rating": 5,
        "text": "My family and I popped in for a lunch today to celebrate my mums birthday and it didn’t disappoint.\nThe staff worked really hard today despite the challenges of the day, and we left a £15 tip to thank them, and to to help show some appreciation for how they handled the day. I’ll definitely be going back, we’re a notoriously a fussy family with exploring new foods, so it was lovely to eat so many new things we enjoyed.\nManager was such a lovely man and we wish the staff the best"
    },
    {
        "name": "Elia Greek Restaurant",
        "rating": 4,
        "text": "I booked a table for a birthday dinner at 7pm on a Sunday. We had 5 starters and 4 mains. A bottle of Prosecco to share, two cocktails and a pint. The food is delicious and the table service is excellent. Total bill was £153 excluding a tip. Very good value for quality dining."
    },
    {
        "name": "Elia Greek Restaurant",
        "rating": 5,
        "text": "We dined here today for lunch and we’re so glad that we picked Elia!\nLocation is very central and is opposite the Christmas Market on George Square. We had a friendly greeting and were seated straight away even though the restaurant was busy. We opted for the Meze for Two which consisted of starters, mains, desert and coffee all for £58. The dishes were all chefs choice apart from the desert which we could choose. We enjoyed every single dish and got to try things that we may never have ordered. Great service from the waiting staff too. Overall very happy with our visit and will come back."
    },
    {
        "name": "Elia Greek Restaurant",
        "rating": 4,
        "text": "Beautiful, fresh food. I've been wanting to try here for a while and so glad we finally did. Service was good and we were given complimentary bread, olives and oil, which was nice. My only complaint would be for starters we ordered hummus and tzatziki which came on big plates, we were given 1 pitta between 2 people. I feel for the amount in each starter we could have done with a pitta each. We would definitely return."
    },
    {
        "name": "Elia Greek Restaurant",
        "rating": 5,
        "text": "You can smell the delicious food before entering the restaurant!\n\nWe tried the lunch menu which have a good amount of options already. The dolma is really tasty, so are the tzatziki with pita bread. I had the lamb souvlaki and its sooo tender, cooked literally to perfection, the portion size is pretty big, thoroughly enjoyed that. My friend ordered the Smyrneika, the meatballs are nice but a bit salty, the sauce is amazing tho.\n\nThe service is great, they had a large menu and plenty seatings, will definitely come back to try more food! Highly recommend this place!"
    },
    {
        "name": "Elia Greek Restaurant",
        "rating": 5,
        "text": "One of my favourite dining establishments and maybe the best Greek in Glasgow. Terrific food, reasonable prices, and excellent service. Worth booking."
    },
    {
        "name": "Jollibee Glasgow",
        "rating": 5,
        "text": "Omg - this was so good. The mango & peach pie is so much better than McD equivalents.\nChicken was nice and juicy. Spicy chicken was nice and properly spicy.\nOnly negatives was that 2 deliveroo drivers dropped but was still warm when arrived and they forgot/don't offer cutlery which would have been useful with the loaded fries."
    },
    {
        "name": "Jollibee Glasgow",
        "rating": 4,
        "text": "The Spicy Chicken Burger and Peach Mango pie was great, The chicken was tender.\n\nHowever the loaded fries were a massive let down as was the gravy. The cheese was not melted (Likely because the fries were not hot enough)\nThe Gravy tastes like instant gravy you can find at a supermarket."
    },
    {
        "name": "Jollibee Glasgow",
        "rating": 3,
        "text": "Nice junk food if you like to try one day but high price I think compared to other fast food. I hope they take care about cleaning after customers because it is disgusting."
    },
    {
        "name": "Jollibee Glasgow",
        "rating": 3,
        "text": "Came here too try chicken burger. It was good. & there chicken tenders were good too. Gravy was nice flavour. The chicken I got with burger on the side was too crunchy\nAnd very dry. Would return for there burgers and chicken tenders\nReturned 28th September. Dirty tables not cleaned for over 30mins while I ate my food"
    },
    {
        "name": "Jollibee Glasgow",
        "rating": 5,
        "text": "Excellent fast food chain in Glasgow city. The staff and Jollibee training programme definitely deserve credits here.\n\nThey were always smiling and well mannered, hardworking to clean up regularly. So the place looks tidy and welcoming with spacious seating.\n\nFood quality is good with lots of choices. Fair value for money. Overall much much better than other fast food giants 👍🏿👏🏿"
    },
    {
        "name": "Topolabamba",
        "rating": 4,
        "text": "Went to try the Mexican food in Glasgow. Amazing taste, Great Prices and Just sufficient portions. Decor is amazing, staff is friendly and courteous. Definitely recommended."
    },
    {
        "name": "Topolabamba",
        "rating": 5,
        "text": "Fantastic meal following a long day at work. I have the chicken tinga tacos and shredded beef tostados. Both were excellent and left just the right amount of tingle on the tongue.\n\nEspresso martini was also a delight. I would really struggle to find fault with my visit as staff were also excellent"
    },
    {
        "name": "Topolabamba",
        "rating": 4,
        "text": "This place looks really nice, but I don’t think that food is that great. Prices are okay, but I ordered Chicken Chimichanga and it was quite bland. Virgin Margaritas are pretty small. Also, they add 10% service even if you’d order only drinks and be in a group that is Less than 5 people (most places are adding 10% when group is bigger than 5 people, so I was really surprised)."
    },
    {
        "name": "Topolabamba",
        "rating": 4,
        "text": "Probably the best mexican restaurant I've been to in Glasgow, well apart from Bibis but that's a different experience and not central.\n\nFoods really good, service is excellent and it's a good atmosphere.  Nothing to fault really.  Been twice and wouldn't hesitate to go back\n\nStill not as good as taco van in LA tho ☺️"
    },
    {
        "name": "Topolabamba",
        "rating": 5,
        "text": "Went here after a friend recommended it, and it was during the cycle race so super busy. Waitress was super nice, front of staff guy lacked a bit of personality. Atmosphere and food was delicious. I found 4 tapas plates too much for me to eat, but they happily put it in a takeaway box for me to finish off later. The family & I will eat here again when we are in Glasgow next time."
    },
    {
        "name": "The Citizen Glasgow",
        "rating": 5,
        "text": "That Shetland mussels was a must have. The flavor was just insanely good. Good portion size too!\n\nThe steak sandwich was fantastic too!\n\nThat Burger though was slightly on the dry side unfortunately. The chips were cut in special shape to enhance taste and well cooked.\n\nGreat friendly service! Will definitely come back again!"
    },
    {
        "name": "The Citizen Glasgow",
        "rating": 5,
        "text": "Visited The Citizen for a belated Christmas work meal and it did not disappoint!\nThe staff were very welcoming and friendly. I went for the Korean Crispy Chicken starter - absolutely delicious, full of flavour!\nI had the Harissa Lamb Shank for main and so glad I did! The lamb fell off the bone, there was so much meat! The truffle mash was delicious and the honey roast carrots & crispy onions tasted delicious!\nEnjoyed the meal so much, I went for a dessert, the chocolate and baileys cheesecake. Delicious end to a lovely meal!\nWould definitely be back and would recommend."
    },
    {
        "name": "The Citizen Glasgow",
        "rating": 5,
        "text": "We had our works Christmas night out here. The atmosphere is great. A lot of these places will blare out loud music. But this was kept a low volume here. So you can engage in conversations while the music just soothes in background.\n\nI ordered the haggis-turkey-sticky toffee pudding. All excellent choices. Turkey was quite juicy.\n\nWould definitely come here again."
    },
    {
        "name": "The Citizen Glasgow",
        "rating": 5,
        "text": "Nice restaurant with good atmosphere. Variety of drinks, good and fast service.\nDifferent options of meat, chicken, and fish plates."
    },
    {
        "name": "The Citizen Glasgow",
        "rating": 5,
        "text": "My favourite. I've been many times and never once has there been the slightest thing to complain about. The food and drinks are of very high standard and the service you get is always the absolute best. I just love it here."
    },
    {
        "name": "The Spanish Butcher",
        "rating": 5,
        "text": "Restaurant has a lovely interior. The food was delicious and the steak perfectly cooked. The smoked salmon starter was a bit bland and presentation was odd. The panacotta was really good though. The service was quite disappointing in comparison to the food, and not very attentive. Overall a good option for a special occasion."
    },
    {
        "name": "The Spanish Butcher",
        "rating": 5,
        "text": "Take their lunch set menu: street corn is amazing! However, the rump steak is just okay - good but not that surprising. Almond tart is good also they have a good red wine from Rioja.\n\nI will come back to try other types of steak :)"
    },
    {
        "name": "The Spanish Butcher",
        "rating": 5,
        "text": "What a incredible experience from the moment we arrived (albeit the table wasn't ready but that's ok)\nI believe our server was Stefano, this guy needs a raise! He had so much knowledge of the menu from the steaks and the flavours, sides, sauces and how the bone marrow is cooked.\n\nHe went above and beyond.\nThe steak for our party of 4 (one had a burger but was equally very happy with it!) Was cooked to perfection and how we asked for it.\nBone marrow for me was a let down, underwhelming but that's a personal preference as I'm not sure what flavour I expected.\nOtherwise I highly recommend this place for a good steak and truffle fries.\n\nPerhaps offer truffle fries with the burger too though? Think they miss out with the skinny fries instead!\nThank you Stefano for such a pleasant experience, just wish the tip went directly to him!\n\nPictured is the bone marrow and scotch fillet. Others had the galacian which they said was well worth the money."
    },
    {
        "name": "The Spanish Butcher",
        "rating": 5,
        "text": "Great little restaurant and bar. We only stayed for a couple of cocktails and some oysters (which were top notch), but all the food looked incredible. Staff were very friendly as well.\n\nThe old fashioned with Pedro Ximénez sherry was incredible.\n\nCan't wait to come back and try the food next time."
    },
    {
        "name": "The Spanish Butcher",
        "rating": 5,
        "text": "The food was absolutely amazing and I will definitely be returning soon. If you're looking for outstanding food and impeccable service, this is the place to go."
    },
    {
        "name": "Mini Grill Steakhouse - Glasgow",
        "rating": 4,
        "text": "Nice atmosphere and lovely food! I enjoyed the fillet steak, very nicely cooked, although was more impressed by my partner's dish of choice which was a Trio of Lamb, truly beautiful dish and delicious. Staff were friendly and attentive. The chips that came with the steak were amazing! It's a small but cosy restaurant, I like that the place is central but in a quieter location on Bath Street."
    },
    {
        "name": "Mini Grill Steakhouse - Glasgow",
        "rating": 5,
        "text": "We visited here to celebrate my wife’s birthday and this place did not disappoint. Both Trisha and Emma greeted us with such a lovely warm welcome and looked after us just perfectly. The food is absolutely amazing. We are not going to wait for a birthday until we go back. Love this place."
    },
    {
        "name": "Mini Grill Steakhouse - Glasgow",
        "rating": 5,
        "text": "Absolutely loved it. My new favourite restaurant.\nI had food envy before I'd even ordered because the menu is so good and I knew I'd miss out on something.\nHaggis trio was some of the best haggis I've had. I begrudgingly went for lamb (instead of steak, in a steak place, I know), and that shepherd's pie is genuinely the nicest mouthful of food I've ever eaten.\nStaff were excellent. Nice atmosphere, cosy but not too crowded. Good wine. A little pricey, but worth it!"
    },
    {
        "name": "Mini Grill Steakhouse - Glasgow",
        "rating": 5,
        "text": "We were recommended the restaurant and were not disappointed.  From the welcome and service from Tricia.  TO the food and wine. Everything was excellent.  Trivia gave us great advice on what we ordered and she was spot on. The chateaubriand for two was perfect. Perhaps one of the most delicious steaks I've ever had."
    },
    {
        "name": "Mini Grill Steakhouse - Glasgow",
        "rating": 5,
        "text": "At Mini Grill in Glasgow, you can expect both outstanding steak and impeccable service. The steak offerings are simply exceptional, prepared to perfection and bursting with flavor. The attention to detail in cooking and presentation is evident in every bite. The service provided by the staff is equally impressive – attentive, friendly, and knowledgeable about the menu. This winning combination of great steak and top-notch service makes Mini Grill a must-visit destination for those seeking an unforgettable dining experience."
    },
    {
        "name": "The Italian Kitchen",
        "rating": 4,
        "text": "Nice Saturday afternoon for lunch and catch up with family. I would advise booking as was very busy. Great extensive menu, lovely atmosphere inside, our waitress was lovely, friendly and efficient. Now to the food :) I had the stuffed pepper that was lovely although I felt could have been cooked that wee bit longer. The pasta was similar nice although felt it could also have been cooked a little bit longer. I would go back and try something different.  Reasonable priced and coffee (flat white) was OK if a little strong"
    },
    {
        "name": "The Italian Kitchen",
        "rating": 4,
        "text": "I really liked this place. The servers were great and one of them was very funny, which is always nice. The pasta was very tasty. However, the pasta was a bit overcooked, which was a bit disappointing.\n\nMy pizza was the star of the show, though. It was easily one the best and most tasty pizzas I've had in Glasgow. Using that oven definitely makes a difference. The bottom was crispy without being burnt, and the toppings were generously added on.\n\nThe waiter didn't use a notepad and forgot one of the items from the order. It's all fine and well if you can remember everything, but if not, it's not best to just jot it down.\n\nThe decor and overall atmosphere of The Italian Kitchen was top tier. Overall, this place would be ideal for a date or family meal. Highly recommend."
    },
    {
        "name": "The Italian Kitchen",
        "rating": 5,
        "text": "Really special night. We booked in advance for a table for 19 to feed our wedding guest. We just wanted a nice relaxing meal after a small cosy wedding. This place was perfect we have eaten here before and the food was fab! They served up a set menu which had something for everyone (menu 2) I think it was very reasonably priced and a perfect way to end our celebrations. The server were excellent my guest were never without a drink and there was nice spaces between course. Really great day to end our day so glad we picked this place."
    },
    {
        "name": "The Italian Kitchen",
        "rating": 4,
        "text": "Good place for a relaxing meal, which tastes good and served timely.\nThe staff are nice , though if the place is busy they can be a bit distracted and disregard signs from customers clear as daylight.\nThe pizza is ok, ours was fine but we had a bit of flex in the pasta base. I would not go for specifically for the pizza here and they have no other base than tomato base.\nMany places near by has other base at least a few.\nThe chips is great and the pumpkin soup was delicious. The squid could be better, as a starter that was a bit rough.\nCoke was a bit strange, not sure which type was it. Otherwise clean and tidy place but a bit crammed and no option to have a pram at your table which makes a bit complicated for families with little one."
    },
    {
        "name": "The Italian Kitchen",
        "rating": 5,
        "text": "Delicious Italian food for a good price. The gamberoni pasta was delicious and we liked the service too. Perfect for a nice occasion"
    },
    {
        "name": "The Anchor Line",
        "rating": 5,
        "text": "Lovely restaurant in the centre of Glasgow. The staff were very attentive. We had a voucher from itison and it was brilliant. There were a good few things on the menu that could be made gluten free. Nice atmosphere and a lovely meal. Thank you!"
    },
    {
        "name": "The Anchor Line",
        "rating": 5,
        "text": "Went here just after Christmas for some cocktails. Didn't have a booking but they still managed to find us a table. Really nice atmosphere and table service. Cocktails are really good with some classics and specials."
    },
    {
        "name": "The Anchor Line",
        "rating": 5,
        "text": "Highly recommend, food was very nice and reasonable, cocktails were great, service was amazing, the decor and feel to the place really took you back to when it was the old booking office, very busy at the weekend so would book ahead. Reasonable prices"
    },
    {
        "name": "The Anchor Line",
        "rating": 5,
        "text": "We popped in here while out a walk in town and it was absolutely stunning\nService is top class and as expected so was the drinks and oysters\nOnly wish we found it earlier on walk as we couldn't stay longer.\nMy first time trying oysters and loved them.\nWe will be back for cocktails and oysters very soon.\nA great place in the heart of Glasgow"
    },
    {
        "name": "The Anchor Line",
        "rating": 5,
        "text": "The food and service were excellent. Def on my list of fave restaurants."
    },
    {
        "name": "Eusebi Deli",
        "rating": 5,
        "text": "Chilled atmosphere with cafe/deli at the front, lovely staff, great food beautifully presented. Varied menu including pizza and pasta options. Pasta on the dearer side at £19 for prawn linguine but I’d say well worth it - quality ingredients and fresh flavours. Pizza also looked amazing with generous toppings."
    },
    {
        "name": "Eusebi Deli",
        "rating": 5,
        "text": "A nice place with a great atmosphere and wonderful food.\n\nHad the arancini and the cacio e pepe toast and they were delicious.\n\nThe atmosphere is great for a dine in and chat and the design of the place is spacious which gives very relaxing outgoing vibes.\n\nThe servers however were not in a very good mood that day for some reason. I do not want to judge the service fully as I was there for less than an hour so I will give it a pass as it did not affect my visit as much."
    },
    {
        "name": "Eusebi Deli",
        "rating": 5,
        "text": "I normally look up places ahead of time for food, but we were hungry and walking back from the Art museum and this Deli appeared. We were just expecting a sandwich, but a table for two was available downstairs. I couldn't decide on what to get, but the tables to either side of us had pizza. And the server said go with the pizza. So I went with the roman sourdough pizza with smoked tomatoes, mozzarella, sausage and honey. It was amazing. Highly recommend. Just wish I had room for some dessert!"
    },
    {
        "name": "Eusebi Deli",
        "rating": 5,
        "text": "After submitting the final assignment, there is no better way to celebrate than a good meal. Very delicious starter, pizza and drinks. 🍹\nI will come here again to try the coffee and desserts :)"
    },
    {
        "name": "Eusebi Deli",
        "rating": 5,
        "text": "What an amazing place, I have passed it many times but this is the first time I have been there. The food and service were excellent, so this won't be the last time.  Thanks for a lovely lunch. ps the dressing on the salad was awesome. 😀😃"
    },
    {
        "name": "Stravaigin",
        "rating": 4,
        "text": "Excellent place. Even though I didn't know you had to make a reservation, they seated us at the bar area and served great food. Selection was limited because they had a \"busy weekend\" and was out of steak and some other assorted menu items. I had the haggis to start and pork belly as a main. Superb!"
    },
    {
        "name": "Stravaigin",
        "rating": 5,
        "text": "After a brisk walk through Kelvin Park we arrived at Stravaigin, the Cellar. We were seated after my partner managed to smash a glass through careless control over her hand bag. We were presented with menus and I chose the Haggis Neaps and Tatties which came as three equal sized portions with sesame seeds. I followed this with steak, chips and pepper corn sauce. The waiter checked back on us a few times which was a nice touch. The desert was a small meringue with a sorbet and so apple shavings???\nWe had coffee, paid the bill and thanked the waiter.\nThis is a nice place to eat in a busy local venue."
    },
    {
        "name": "Stravaigin",
        "rating": 5,
        "text": "Great atmosphere, I went in the Christmas time and the restaurant was super cute all covered by lights. The food was ok and the staff was super friendly."
    },
    {
        "name": "Stravaigin",
        "rating": 2,
        "text": "This restaurant was highly recommended, we came but didn't book a table, we were seated behind the bar and we understood because it was our mistake, but the waiters bypassed us and ignored us, they always left somewhere, we couldn't even call anyone . When it came time to eat, no one informed us that the food we ordered would be so spicy, the menu did not say so. The mussels were peppered with jalapeño, which was not mentioned on the menu, and the curry prawns were super spicy. When we reported this to the waiter, he said that we should have warned him and he would have brought us yogurt to reduce the burning sensation, this is very funny, we didn’t  expect this, we expected everything, but not this response. The atmosphere was very good, but the evening was completely ruined."
    },
    {
        "name": "Stravaigin",
        "rating": 5,
        "text": "Had a fab meal today for Sunday lunch! Felt like royalty and the food was outstanding!\nThe staff were so attentive especially Ilaeira and Morven, kitchen staff went the full hog and beef roast was just so tender, not sure how they achieve such excellence in taste and flavour but everything was cooked to perfection. Cocktails were also top notch especially the espresso martini! Could have had more if we had more time. Really enjoyed sitting by the cosy fireplace and was nice to be accompanied by a few waggy tails next to us. Really was ant least 5 stars all round, keep being authentic and original!"
    },
    {
        "name": "La Vita Spuntini City Centre",
        "rating": 3,
        "text": "Food was great, staff friendly and helpful. We didn't like where our table was sitting which was right next to the stairs leading to toilets. On a busy Saturday afternoon this meant there was a constant stream of people squeezing passed each other next to us while we were being served and eating, staff were also squeezing passed moving tables and chairs. Our table was not nearly big enough for our dishes. Enjoyable but not very relaxing."
    },
    {
        "name": "La Vita Spuntini City Centre",
        "rating": 4,
        "text": "They offer a great tasting menu where you can order three small dishes. I ordered the pizza, spicy potato bites and garlic bread and it was all great, really nice flavours and good value for money. Will definitely be back to sample their other dishes."
    },
    {
        "name": "La Vita Spuntini City Centre",
        "rating": 4,
        "text": "Went here just after Christmas. Booked online and was given a table upstairs.  The restaurant was really busy, we opted for the Christmas menu. I had the pate which arrived looking whipped, almost like chocolate frosting. There was so much, I didn't enjoy it.  For the main I really like the pasta Penne Mia Casa, was so nice. Its Penne pasta with chicken, broccoli and chilli. I had enough and didn't have dessert but still had to pay for all 3 courses.  My friend enjoyed her 3 courses, we had some cocktails they were not bad.  Would go back and think maybe when else busy would be have a better experience."
    },
    {
        "name": "La Vita Spuntini City Centre",
        "rating": 5,
        "text": "Had a meal here on Friday night with my partner and had a great experience.\n\nThe decor is beautiful, inside and out, the whole place is very clean and well laid out and the staff were very attentive and friendly.\n\nWe had one of their sharing dishes plus a few sides (Carbonara, parmesan fries, garlic bread and 5\" pizza) and everything was delicious and extremely reasonably priced compared with other similar establishments in the area. We had a few cocktails as well and these were also very well made and delicious.\n\nPerfect venue for date night or group celebrations.\n\nWould definitely recommend and will certainly be back in the future"
    },
    {
        "name": "La Vita Spuntini City Centre",
        "rating": 5,
        "text": "This was a gift from my daughter,it was Friday 29th Dec and the atmosphere was superb.We were seated upstairs and it was very cosy and exceptionally hot,Waiting Staff were quick to serve and friendly,cocktails  were delicious and the food was piping hot and plentiful the deserts were huge and rounded off our meal,it was very reasonably priced   10/10"
    },
    {
        "name": "Mediterraneo Italian Restaurant & Champagne Bar",
        "rating": 5,
        "text": "Booked the private room for a smallish wedding 40+ guests.\n\nNuncio, Anna, and every single one of the staff made it so easy for us. They could not do enough. Real old style Italian hospitality. The food as usual was excellent. Always 5 stars.\n\nI would recommend this Mediterraneo in a heartbeat for everything from a simple romantic meal to a small conference in the private area.\n\nThank you everyone for making a special occasion very special. ❤️"
    },
    {
        "name": "Mediterraneo Italian Restaurant & Champagne Bar",
        "rating": 5,
        "text": "Popped in by chance and would be back. 100% recommend, service was quick and all of the staff were wonderful. Food was excellent and very reasonably priced. Surprised by size of side dish as shown in photo."
    },
    {
        "name": "Mediterraneo Italian Restaurant & Champagne Bar",
        "rating": 5,
        "text": "Very nice place. The food was quite good. I had the beef tagliatelle and the burrata with tomato starter. The starter was fresh and lovely. Mains was good too. And service was also quite good. All in all, happy with the whole package."
    },
    {
        "name": "Mediterraneo Italian Restaurant & Champagne Bar",
        "rating": 5,
        "text": "I ate here with a bunch of friends for my partners friends' 40th. Food was delicious and our waiter was lovely. Me & my partner shared the chateaubriand it was 10/10."
    },
    {
        "name": "Mediterraneo Italian Restaurant & Champagne Bar",
        "rating": 5,
        "text": "Food was good, they have a lunch menu too."
    },
    {
        "name": "Fanny Trollopes",
        "rating": 5,
        "text": "Great service, fantastic food. The rainbow trout with wipped goats cheese was unusual and outstanding. Deserts a great end to a really good meal."
    },
    {
        "name": "Fanny Trollopes",
        "rating": 5,
        "text": "We had dinner at this lovely place. The waiter was very kind and charismatic, which absolutely contributed to the ambiance in the restaurant. The dishes were of good quality and were \"complex\"; a lot of well chosen, special and tasty ingredients. The pricing is fair.\n(The pigeon starter is very tasty, I forgot to make a picture)"
    },
    {
        "name": "Fanny Trollopes",
        "rating": 5,
        "text": "Still ranks as one of my favourite restaurants in Glasgow. Top class food and service at affordable prices. A Glasgow must visit."
    },
    {
        "name": "Fanny Trollopes",
        "rating": 5,
        "text": "AMAZING dinner we had at Fanny Trollopes!\n\nAll the seafood was so fresh and cooked to perfection - especially the scallops they did an absolutely fantastic job.\n\nOne thing I really love was how starters came in such a generous portion.\n\nAdded on edit: All staff were also so so nice and friendly. And that perfected our time there. Really appreciate their hospitality.\n\nIt was my first time here but I will surely turn into a regular. Highly recommended!!!"
    },
    {
        "name": "Fanny Trollopes",
        "rating": 5,
        "text": "Super tasty food and a fun, quirky venue. Staff were great, very friendly. Starters were lovely and big portions! The scallops with black pudding were a favourite. We ended up having the specials for mains - the smoked pork belly and the fish of the day - which were both delicious. Would recommend for a special occasion or just a nice meal out."
    },
    {
        "name": "Gōst",
        "rating": 5,
        "text": "Absolutely fantastic festive lunch. Started with a simple\nBooking process, the restaurant was very accommodating to our various needs - we were a group of 23. Food was tremendous, very tasty, good time between courses and plenty of it 😂. Staff looked after the whole group very well, no long waiting that you would expect at this time of year. Drinks were excellent too, great selection of cocktails. We will be back.. cheers"
    },
    {
        "name": "Gōst",
        "rating": 5,
        "text": "Best steak restaurant in Glasgow. Service from Andrew was wonderful. We were greeted to a lovely booth and the atmosphere was spot on. The food was that good we managed to squeeze in a dessert 😄"
    },
    {
        "name": "Gōst",
        "rating": 5,
        "text": "Delighted with my experience at Gosht restaurant! Introducing a friend to Scotland, I sought a quality halal steakhouse, and Gosht exceeded expectations. The ambience was lovely, service warmly welcoming. The sirloin steak was a revelation—undeniably the best I've ever had, incredibly juicy. The mocktails were beautifully crafted. While it leaned towards the pricey side, the exceptional fine dining experience made it worthwhile for special occasions. A special shout-out to Ellie, Rueben, and the talented chef who made our evening memorable on Friday, 26th January."
    },
    {
        "name": "Gōst",
        "rating": 4,
        "text": "Overall a pleasant dining experience. Dishes were hit and miss. Snails were rather blend and tasteless, raw oysters were small but tasty and fresh, scallops were good, however the ribeye steak was the highlight of all. Tender juicy well aged and perfectly grilled, one of the best in town. Most staff are friendly and attentive, we were late due to having too much fun in another cocktail bar prior to coming for dinner, the front door lady was not happy and you can tell from her face and her tone of voice, that made us felt uncomfortable and guilty, there were many empty tables and wasn’t that full while we arrived but she was putting on a wide smile when we left."
    },
    {
        "name": "Gōst",
        "rating": 5,
        "text": "Visited over the weekend with friends, we were hosted by Nicole who was absolutely spot on. She went above and beyond for us to ensure we were able to get exactly what it was we were looking for. Her colleague Andrew was great too. The food was great, there was something for everyone, drinks were cracking especially the cocktail - 'Spectre'. Thank you both & to the rest of the team for a great experience."
    },
    {
        "name": "O Sole Mio",
        "rating": 5,
        "text": "Lovely little Italian restaurant! Food was amazing and staff were very attentive and polite. Cocktails were good too. Would recommend the black ink spaghetti with the scallops,  absolutely delicious! Will definitely be back here next time I visit Glasgow!"
    },
    {
        "name": "O Sole Mio",
        "rating": 5,
        "text": "Nice small authentic Italian, decent food. Pleasant service, happily recommend."
    },
    {
        "name": "O Sole Mio",
        "rating": 5,
        "text": "Absolutely amazing, the prices are amazing considering the quality, the service, the atmosphere. It’s everything you could ever want from Glasgow, homely, friendly, kid friendly with lovely staff with amazing food! Making an effort to every week now. Thank you!"
    },
    {
        "name": "O Sole Mio",
        "rating": 4,
        "text": "Just a walk in and was happily shown to our table. Staff front of house attentive, good options of menu,we had a lunch time special. Minestrone soup,and bruschetta starter, followed by lasagna,  and a chicken mushroom, veg and rustic chips."
    },
    {
        "name": "O Sole Mio",
        "rating": 4,
        "text": "We were here for dinner on 30/01/2024.  Fabulous food in a lovely restaurant and the staff were polite and helpful.  I have unusual allergies but, there were no problems and I wasn't made to feel like I was a nuisance.  Definitely highly recommend this restaurant"
    },
    {
        "name": "Opium",
        "rating": 5,
        "text": "Really lovely food and quick service. Would defo go back and try more starters. Had three courses but didn't feel bloated or too full. Was just the perfect amount. Staff were lovely."
    },
    {
        "name": "Opium",
        "rating": 5,
        "text": "Kate loved the vegetarian options and the clay pot aubergine was melt in the mouth. Staff were really attentive. I highly recommend the soft shell crab which had a warm heat to them that left my lips tingling. Perfect spot for a lovely meal."
    },
    {
        "name": "Opium",
        "rating": 5,
        "text": "This is one of the best Asian meals I've ever had. The plum ribs were an absolute standout - the best I've ever had! Can also recommend their twist on a Pina colada.\n\nCan highly recommend this place, especially their dim sum options."
    },
    {
        "name": "Opium",
        "rating": 5,
        "text": "Amazing Asian fusion food with fabulous veggie/vegan offerings. Light, crisp, differentiated flavours with some of the best deep fried tofu I've ever had. Non alcoholic Heineken and tasty £5 mocktails as well. A small place that was packed all night so book. Excellent service with water constantly topped up: most responsible."
    },
    {
        "name": "Opium",
        "rating": 5,
        "text": "Hadn't been to the restaurant in about 4 years and had totally forgotten how good it was! Amazing food, full of flavour and great selection of dishes to choose from. Staff were great and very attentive. We ordered quite a few dishes as there was so much we wanted to try, everything was delicious. My beef fillet main was 👌"
    },
    {
        "name": "Verona",
        "rating": 5,
        "text": "Service was excellent and the chef came out to enquire about our meals. Thd mussels as a starter were my highlight. Would definitely go back."
    },
    {
        "name": "Verona",
        "rating": 5,
        "text": "Lovely food and friendly service. Bargain lunch menu."
    },
    {
        "name": "Verona",
        "rating": 3,
        "text": "We came in on the off chance of grabbing a table.  The man at the front of house said we could but he needed it back ASAP and we needed to be quick.  The service was then really slow, the starters were quick to come out but the mains took a good half hour at least to come out.\n\nThe food was okay but nothing to really shout about but it was decent value for many as we got 2 courses for £20 on the pre theatre menu."
    },
    {
        "name": "Verona",
        "rating": 3,
        "text": "Staff were nice, starters were good, the lasagne was watery, however, they have started adding a service charge, for a table of 10 I get it, but for a table of 2? Come on, I left the exact money and didn't tip. As I'll do with anywhere putting a service charge on."
    },
    {
        "name": "Verona",
        "rating": 2,
        "text": "The food is really nice, but the waiter and owner of the restaurant were way too chatty, asking invasive personal questions, even though I clearly showed that I don't want to engage with them in a conversation and it happened to me several times already. Probably not visiting ever again."
    },
    {
        "name": "Ubiquitous Chip",
        "rating": 5,
        "text": "Amazing decor.  Great drinks and menu.  Loved having a vegetarian tasting menu.  Wish they advised we needed to specify if we wanted a tasting menu when making our reservation.  Glad they were able to accommodate.  Time in between courses was a bit long.  Looking forward to coming back."
    },
    {
        "name": "Ubiquitous Chip",
        "rating": 5,
        "text": "We had the taster menu with the wine flight. The food and wine were a great match and made the evening great. Service was friendly and good."
    },
    {
        "name": "Ubiquitous Chip",
        "rating": 5,
        "text": "Definitely the place for a fancy occasion, it's otherwise a bit too pricey for a casual meal. But the service and atmosphere are sublime.\n\nTheir selection of ice wines are incredible, and the food overall were delicious. They looked small but were actually very filling!"
    },
    {
        "name": "Ubiquitous Chip",
        "rating": 5,
        "text": "The inside of The Ubiquitous Chip is worth the trip alone, so incredibly stunning. This is a must! Food & wine is awesome, service was really great! So glad we got a reservation here, added a great experience to our trip!"
    },
    {
        "name": "Ubiquitous Chip",
        "rating": 5,
        "text": "What an awesome find!\n\nHands down the best food we tasted in Glasgow 🤤 The location is super unique and the atmosphere is chic with a trendy vibe. Easily a romantic date night or dinner with good friends.\n\nGreat wine list and all the dishes were elevated with amazing flavor profiles. Their presentation was on point 👌\n\nThis will definitely be on our  recommendation list for friends and family traveling to Glasgow.\n\nWould recommend a reservation, but general seating is available. Great location 💯"
    },
    {
        "name": "Pulcinella",
        "rating": 5,
        "text": "My partner and I tried this restaurant as we couldn’t decide where and what to eat on a Wednesday night. They have the 2 or 3 course dinner menu which is absolutely smashing with great prices (less than £19 for 2 course). We had the grilled asparagus and prawn cocktail salad, Turkey with cranberry sauce and Chicken with mushroom sauce.. To our surprise, we love every dish here. We had a wonderful dinner, the food served were all fresh, delicious and generous in portions. Servers are all prompt and attentive. The ambience here is warm, inviting and authentic.\nDefinitely will bring friends here."
    },
    {
        "name": "Pulcinella",
        "rating": 3,
        "text": "Basic Italian restaurant .\nFood was ok.\nThe restaurant is a little bit old but with lot’s of Italian items :)"
    },
    {
        "name": "Pulcinella",
        "rating": 5,
        "text": "Busy Saturday night but the staff couldn't have been more accommodating. Food was delicious, my two year old loved his pasta. We couldn't resist trying some ourselves.\nMelt in the mouth salmon, house wine was really really nice. Looking forward to going back."
    },
    {
        "name": "Pulcinella",
        "rating": 5,
        "text": "Myself and two friends were looking for somewhere to eat last night (it was a saturday) and stumbled upon Pulcinella.\nEven though we didn't have a reservation, they found a table for us, and the managed was very welcoming.\nThe waiters were all very polite and efficient with one of taking a photo for us as we couldn't manage to get all of us in the photo.\nWe all ordered our 2 courses and when the food came I have to say it was some of the best I've tasted. I had bruschetta for a starter, and it was so fresh and bursting with tomato flavour. For my main I had a pizza and it was one of the best pizzas I've eaten in my life\nMy two friends also thoroughly enjoyed their food too with everyone complimenting how good it was.\n\nThe atmosphere of the restaurant is perfect, it's very homey and welcoming. I think it is a great all-around place that would be perfect for romantic dates and also for family meals and whatnot.\n\nAll in all, I know the next time I visit Glasgow, this will be one of my go-to places to eat"
    },
    {
        "name": "Pulcinella",
        "rating": 2,
        "text": "The staff was very rude. When I asked what the dessert of the day was I got told rather harshly \"no, no, no, no dessert of the day today\" however wasn't overly fussed by that. I had the pizza which was very tasty and a cocktail. When we got the bill we kindly asked for the service charge to be removed where the waiter was confrontational when asking if we wanted it removed, snatched the receipt off of the table and crumpled it up in their hands, before stroming off to get a new receipt. Was an enjoyable experience up until that point."
    },
    {
        "name": "'BABS",
        "rating": 4,
        "text": "A modern gourmet kebab house right in the heart of Glasgow City Centre.\nFriendly staff served the most delicious Greek/Turkish food, cooked to perfection. We had the special offer lunch menu for around  £13 - choice of mains, fries and soft drink - great value.\nWe will definitely return!"
    },
    {
        "name": "'BABS",
        "rating": 5,
        "text": "It was just walking distance from the hotel where we were staying in Glasgow, not only that but it also had a good review on Google. There was a pleasant atmosphere, and there was no problem ordering food by looking at the menu. But after we ordered, we just asked them if they had any special items, and then they recommended the Lamp Escander, it was the best dish of what we ordered. As I had to leave in the morning, I postponed my desire to go for another time."
    },
    {
        "name": "'BABS",
        "rating": 5,
        "text": "Absolutely lovely restaurant, fully booked but made an effort to accommodate and got us a reservation to return in an hour (unlike multiple other restaurants that just turned us away)\n\nFood was incredible, (having lived in Greece, it lived up to the standard!) staff were lovely, attentive and we also enjoyed some great, reasonably priced cocktails too!\n\nWe both enjoyed a chicken and halloumi souvlaki as well as a side of Ravasaki (Fried Feta in honey) then shared a delicious chocolate tort. So 2 cocktails, one starter, 2 mains a side and a pudding (and a tip) all came to £61.50 which we thought was very reasonable.\n\nHighly recommend"
    },
    {
        "name": "'BABS",
        "rating": 5,
        "text": "The food quality was great. It came in quickly but the portion was relatively small especially the burger.\n\nFriendly staff and beautiful setting."
    },
    {
        "name": "'BABS",
        "rating": 5,
        "text": "They were nice enough to let us have a table that was reserved in an hour from the time we arrived. I liked my gyros. My friend likes his lamb (cooked perfectly as he asked)."
    },
    {
        "name": "Tony Macaroni Glasgow City Centre",
        "rating": 1,
        "text": "At Tony Macaroni in downtown Glasgow, my experience was unfortunately far from satisfactory. I ordered mussels with garlic bread, largely because it seemed to be one of the few options that wasn't fried or akin to junk food. The presentation was disappointing: the mussels were crowded onto a small plate, with no side dish for the empty shells, rendering the meal mediocre at best.\n\nOn a slightly positive note, the dish was not overly salted, which I appreciated. However, the service left much to be desired. I requested hot water with lemon and was served cold water with a slice of lime instead. Overall, I can't say I'd recommend the experience."
    },
    {
        "name": "Tony Macaroni Glasgow City Centre",
        "rating": 3,
        "text": "This was a lovely family dinner, meal & service were excellent but I think we'd booked on Teen night. There were numerous tables of kids likely aged 14-18 who were all very well behaved but as you'd expect, pretty noisy so it made it difficult for us to hear our own conversation at times. I'd maybe suggest cordoning off an area for these guys, I think it's great they have somewhere to go (and buy 2 starters between 8 😂) but maybe creating a little divide would help everyone enjoy the space.\n\nI do also have to mention that the toilets are dreadful and in serious need of a refurb, as is the carpet (which is sticky) in the stairwell to the toilets. But that can't be helped by the staff who were all fabulous."
    },
    {
        "name": "Tony Macaroni Glasgow City Centre",
        "rating": 4,
        "text": "Food was enjoyable. Staff were very warm, friendly and helpful with choice of menu. Although we didn't get to eat any dessert because we were extremely full from having the starter platter and the main dish."
    },
    {
        "name": "Tony Macaroni Glasgow City Centre",
        "rating": 4,
        "text": "If you're on a budget then this place is good enough.\nWe had pizza, carbonara pasta, calamari starter and white wine.\nWine was good, and the food wasn't too bad either.\nRestaurant did seem not to be looked after, a little cluttered.\nBut otherwise okay experience."
    },
    {
        "name": "Tony Macaroni Glasgow City Centre",
        "rating": 5,
        "text": "We go here regularly for lunch and always have a great experience. All the food we've tried has been great and the staff are always really friendly and helpful."
    },
    {
        "name": "UNALOME by Graeme Cheevers",
        "rating": 5,
        "text": "We had the Six course tasting menu with premium paired wines. I’ve eaten in a lot of Michelin restaurants and Graeme and his team have got it just right. Elegant and stylish setting and superb service, without the stiff over formal atmosphere. It was welcoming and relaxed, the flavours and textures were intelligently combined and paired perfectly with some sublime wines. The staff were well informed and very professional. Quite possibly the best culinarily experience I’ve ever had. Thank you Unalome! You made our valentines night unforgettable."
    },
    {
        "name": "UNALOME by Graeme Cheevers",
        "rating": 5,
        "text": "Absolutely fabulous restaurant… great local ingredients, seafood is always amazing. The mix of different flavours is smashing, it’s a real treat and in a great venue. Both lunch and evening menus have a great variety and all delicious. The service is easily the best I’ve experienced, the staff are willing to do what they can for you. On this occasion, lunch, we got a matching wine set created for us and a cheese board…. It you’re looking for a treat  this is a must visit."
    },
    {
        "name": "UNALOME by Graeme Cheevers",
        "rating": 5,
        "text": "Went on a Friday night for the tasting menu and wine pairing. Food was borderline faultless with great service and interesting wine pairings. Up there with the best tasting menus/meals I’ve had in 2023!"
    },
    {
        "name": "UNALOME by Graeme Cheevers",
        "rating": 5,
        "text": "My first Michelin experience in Glasgow. I enjoyed everything, especially the foie gras, sea bass and the dessert. They also have amazing bread with creamy butter!\n\nWhat impresses me most is that they prepared a surprised petit four for me: when chatting I said I came to Glasgow for my first job and it has been just one month. At the end of my meal, staffs came with congratulations!! It’s quite warm and I’m quite grateful for it.\n\nTheir foods are of good balance so that you won’t feel too heavy, friendly service and kind staffs, will come back again!"
    },
    {
        "name": "UNALOME by Graeme Cheevers",
        "rating": 4,
        "text": "I was told they were awarded a Michelin 1-star rating after being open for 8 months, and I’ve been curious about it. However, while the service was good, the food wasn’t; it was rather ordinary. This place failed to impress me, and I see nothing unique on the menu."
    },
    {
        "name": "Porter & Rye",
        "rating": 5,
        "text": "Every bite of food was so good. Ask the staff which cut to try, they won't steer you wrong. They were very attentive and accommodating. Very cool atmos except for the large painting in the center. Definitely ask about it, though."
    },
    {
        "name": "Porter & Rye",
        "rating": 5,
        "text": "Nice quiet and warm atmosphere, even on Valentine’s Day. Food was stellar, servers very friendly and attentive. Always explaining dishes and gave us a few recommendations for drinks etc. For what you get it’s priced well. It’s like a better Millar & Carter"
    },
    {
        "name": "Porter & Rye",
        "rating": 5,
        "text": "Great place for dinner. Great atmosphere and great food. The starters or small plates were excellent, much better than what you might expect from a steak restaurant. The pigeon was great and very well cooked. Could easily do small plate tapas style rather than have steak.\n\nThe steaks were excellent too and a decent size. Peppercorn sauce was quite creamy, more to my wife’s liking, I like a bit more peppery heat but it was still tasty.\n\nThe carrots side was excellent, you could really taste the difference between the different types of carrot.\n\nI thought the brownie was a bit dry and couldn’t really taste the maple or bacon flavours from the menu but it was decent enough. My wife’s baked Alaska was fantastic.\n\nThe do great inventive cocktails too.\n\nI would definitely go back for a quality meal in Glasgow."
    },
    {
        "name": "Porter & Rye",
        "rating": 5,
        "text": "My partner and I visited Porter & Rye on a Wednesday for our second Valentine's Day; we visited other steak restaurants previously but decided to try out Porter & Rye despite the slightly higher costs.\n\nWe were seated on the ground floor table, with a view into the kitchen and their meat cabinet. The service was very friendly and quick as can be.\n\nThe food was nothing short of spectacular; probably the best steakhouse I'd ever eaten at. I'm a person who swears by a medium rare steak with bare minimum seasoning, but Porter & Rye's sauces took it to a different level. There are a variety of starters, or small plates, to choose from. Beef, pork belly, veggie, venison, pigeon; choose your choice of protein, they'll serve it to you in its tastiest form. We did not get to choose the cut of steak, as we went on the meat-up Wednesday deal, however there was absolutely no complaint on the steak. The sauces were mind-blowing; we ordered the Chimichurri, Macallan & peppercorn sauce, Béarnaise sauce, and Bone marrow & black truffle butter. The most surprising part of this experience is that I did not expect the butter to be any special but I was proven wrong. I'm no wine expert, but whatever red wine we were served, we managed a full bottle of it. Lastly, my partner wanted to end the dinner with a Scottish Coffee; this was not as abhorrent as I thought it would be but it almost wiped me out.\n\nI will definitely revisit Porter & Rye in the future; they are a premium restaurant that serves premium quality food at a premium price (for a damn good reason). If you are a fan of steak nights, I highly recommend visiting on one of their special deal days to get the best value.\n\nThanks to Porter & Rye, I cannot buy Aldi steaks and cook them myself anymore as I know I'll just be disappointed in myself."
    },
    {
        "name": "Porter & Rye",
        "rating": 5,
        "text": "My husband and I came here for dinner one night of our honeymoon in Scotland. The waitstaff were so pleasant, and they took the time to make little gestures like complimentary glasses of Prosecco before dinner and a “Congratulations on your honeymoon” display with our dessert.\n\nOur waitress patiently answered all of our questions, and she took the time to talk to the chef when I, as a picky eater, wanted one of the desserts without half of its ingredients, and they figured out how to make a version I could happily eat.\n\nThe steak was cooked as we ordered, and my husband enjoyed his drinks. The dessert was good, maybe not great, but we were there for the main meal, and that exceeded what we were looking for."
    }
]